{
  "spots": [
    {
      "id": "acid-drop",
      "primaryName": "Acid Drop",
      "alternativeNames": [],
      "description": "Acid Drop is an expert-level reef break that delivers some of Fuerteventura's most powerful and hollow waves. This shallow A-frame near Majanicho produces barreling sections of exceptional quality that can connect with the nearby Majanicho break for incredibly long rides. The wave breaks over a razor-sharp volcanic reef that can dredge and create spit-filled barrels of terrifying beauty, making it one of the island's most challenging yet rewarding surf spots.\n\nThe wave is notorious for snapping boards and demands serious commitment - only very advanced surfers should attempt this spot. When conditions align, the wave transforms into a world-class venue, often requiring jet-ski assistance for the biggest days. The left offers longer, more workable walls while the right delivers shorter but more intense barrel sections that test even the most experienced tube riders.\n\nDespite its remote location, the lineup fills quickly with experienced surfers when this rare gem comes to life. The raw, untamed nature of the spot and its proximity to other quality breaks creates a competitive yet respectful atmosphere among the dedicated crew who know its secrets. The journey to Acid Drop is part of the experience - a rough 4WD track that weeds out casual surfers and ensures those who make the effort are truly committed to scoring this legendary wave.",
      "location": {
        "area": "North",
        "nearestTowns": [
          "Majanicho",
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.72676,
          "lng": -13.993009,
          "accuracy": "verified"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Right",
          "Left"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "NW",
          "W"
        ],
        "bestWindDirection": [
          "E",
          "SE",
          "S"
        ],
        "bestTide": [
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works best on a northwest or west swell with offshore winds from the east, southeast, or south. The waves are powerful and hollow, suitable for chest-high to overhead heights.",
        "abilityLevel": {
          "primary": "Expert",
          "alsoSuitableFor": []
        }
      },
      "characteristics": {
        "crowdFactor": "Low",
        "crowdNotes": "Can be uncrowded but attracts experts when conditions are right.",
        "localVibe": "Serious spot with a high presence of experienced surfers.",
        "hazards": [
          "Very shallow reef",
          "Sharp rocks",
          "Strong currents"
        ],
        "bottom": [
          "Reef",
          "Lava"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "The spot is located near Majanicho. On big days, it can link up with the wave at Majanicho, creating a very long ride.",
        "parking": "Informal parking along the North Shore dirt track.",
        "facilities": "None. The nearest amenities are in Majanicho or Corralejo.",
        "paddleOut": "Difficult and requires careful timing. Paddle out through a channel next to the main peak, avoiding the shallowest sections of the reef.",
        "recommendedBoards": [
          "Shortboard",
          "Step-up"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "bahia-la-pared",
      "primaryName": "Bahia",
      "alternativeNames": [
        "Bahia La Pared"
      ],
      "description": "Bahia is a stunning right-hand reef break nestled in a small dark sand bay beside La Pared's main beach. This scenic spot features a dramatic cliff backdrop and a natural rock tunnel that creates an unforgettable surfing atmosphere. The wave breaks over a mix of volcanic reef and sand, creating unique sections that offer both powerful walls and technical pocket rides, making every wave a new challenge.\n\nThe wave truly shines when La Pared's main beach becomes overwhelming - Bahia handles powerful long-period swells with grace, offering a more sheltered yet technical alternative. The south-facing bay provides natural wind protection, making it a reliable choice when other spots are blown out. The wave's unique geography creates a wedge effect that can amplify size and power, especially on incoming swells that hit the reef at just the right angle.\n\nAdvanced surfers appreciate the wave's consistency and the unique setting that makes every session memorable. The relatively small lineup means you'll often have the break to yourself or with just a few locals who understand its quirks. The cliff-lined bay creates a sense of intimacy with nature, while the rock tunnel adds an element of adventure to your surf session - you can literally walk through a natural rock formation to access the break, adding to the spot's mystical character.",
      "location": {
        "area": "West",
        "nearestTowns": [
          "Pájara"
        ],
        "coordinates": {
          "lat": 28.2135,
          "lng": -14.226,
          "accuracy": "unverified"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "NW",
          "W"
        ],
        "bestWindDirection": [
          "SE",
          "S"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": "Character changes with tide.",
        "bestSeason": [
          "Spring",
          "Summer",
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works best with a powerful, long-period swell (over 10-12 seconds) from the NW or W. It doesn't need to be very large but requires strength. The bay is slightly south-facing, offering a bit of wind protection, making it a good option in onshore conditions. Best when the main La Pared beach is too big or closing out.",
        "abilityLevel": {
          "primary": "Advanced",
          "alsoSuitableFor": [
            "Expert"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Low",
        "crowdNotes": "Less crowded than main La Pared.",
        "localVibe": "A local's spot for experienced surfers; quiet and focused.",
        "hazards": [
          "Strong currents (pulling left out of the bay)",
          "Shallow reef",
          "Proximity to cliffs"
        ],
        "bottom": [
          "Reef"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Drive to La Pared and at the large roundabout, turn right towards the sea, following signs for the Caretta Beach restaurant. Park in the large car park next to the restaurant.",
        "parking": "Large car park available next to the Caretta Beach restaurant.",
        "facilities": "The Caretta Beach restaurant is located at the spot.",
        "paddleOut": "Enter from the beach. Do not enter from the left end of the bay due to the strong current.",
        "recommendedBoards": [
          "Shortboard",
          "Performance Board"
        ],
        "additionalTips": "This is NOT a beginner spot. The reef is shallow and the current can be strong, pulling surfers left out of the bay and towards the cliffs on bigger days. Always be mindful of your position to avoid being swept out. The wave is close to the cliffs, leaving little room for error."
      }
    },
    {
      "id": "bristol-shooting-gallery",
      "primaryName": "Bristol",
      "alternativeNames": [
        "Bristol Shooting Gallery",
        "Shooting Gallery"
      ],
      "description": "Bristol marks the legendary beginning of Fuerteventura's North Shore, standing as a gateway to the island's most powerful waves. Located in Corralejo before the iconic wind turbines, this versatile spot serves both surfers and windsurfers with its dynamic left-hand reef break. The wave breaks over a mix of volcanic reef and rock outcrops that create interesting topography and multiple sections, offering both speed pockets and technical challenges.\n\nThe wave delivers fast, hollow sections that can throw impressive tubes, making it a favorite among intermediate surfers looking to progress their barrel riding skills. The consistent reef produces quality rides across various swell sizes, with the left being the primary attraction while occasional rights offer fun alternatives. The wave's unique position creates a natural focusing effect that can amplify incoming swell energy, producing powerful and consistent walls.\n\nThe scenic location overlooking the Atlantic provides the perfect backdrop for sessions that capture the essence of Fuerteventura's surfing culture. Bristol's accessibility from Corralejo makes it a popular morning session spot, and watching the wind turbines spin in the distance while you wait for sets creates a quintessentially Fuerteventuran experience. The mixed-use nature of the spot means you'll often share waves with windsurfers and kitesurfers, creating a diverse and vibrant ocean community that showcases the island's water sports culture at its best.",
      "location": {
        "area": "North",
        "nearestTowns": [
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.746947975227233,
          "lng": -13.873822689056396,
          "accuracy": "verified"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": "Left is primary.",
        "bestSwellDirection": [
          "NW",
          "N",
          "W"
        ],
        "bestWindDirection": [
          "SE",
          "S"
        ],
        "bestTide": [
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works best with a NW, N, or W swell between 1 and 2.5 meters, combined with SE or S offshore winds.",
        "abilityLevel": {
          "primary": "Intermediate",
          "alsoSuitableFor": [
            "Advanced"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Medium",
        "crowdNotes": "Popular with Corralejo locals, can get busy after work and on weekends.",
        "localVibe": "Generally a local's spot, but welcoming if you show respect. The lineup can be competitive on good days.",
        "hazards": [
          "Reef bottom",
          "Urchins"
        ],
        "bottom": [
          "Reef"
        ],
        "waterQuality": "Generally clean, though proximity to the port can occasionally affect it."
      },
      "practicalities": {
        "access": "The spot is located in front of the wind turbines, at the beginning of the North Shore dirt road which leads to numerous other surf spots.",
        "parking": "Available in the general Bristol area near the harbour.",
        "facilities": "No buildings or services directly at the spot. However, the nearby Bristol area of Corralejo is an old fishing district known for its authentic, local vibe, featuring a variety of seafood restaurants, cafes, and commerce.",
        "paddleOut": "There are several places to enter the water. On days with a large swell, it's best to enter at the end of the wave where there is a small bay.",
        "recommendedBoards": [
          "Shortboard",
          "Performance Board"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "the-bubble",
      "primaryName": "The Bubble",
      "alternativeNames": [
        "Hierro Right",
        "El Hierro",
        "La Derecha/Bubble"
      ],
      "description": "The Bubble is an expert-level A-frame reef break that delivers some of Fuerteventura's most perfect and hollow barrels. This shallow water wave produces exceptional tubing opportunities that attract the island's most skilled surfers. Located near Majanicho in a beautiful beach setting, The Bubble has earned its reputation for board-snapping power and world-class cylinder sections. The wave breaks over treacherous volcanic reef that can dredge and create terrifyingly perfect barrels when conditions align.\n\nThe spot demands serious respect - local surfers have priority, and visitors should consider observing from the sidelines before paddling out. When conditions align with winter swells, the wave transforms into a breathtaking spectacle of precision and power that showcases nature at its most raw and beautiful. Both rights and lefts offer tube riding opportunities, with each direction presenting unique challenges and rewards for the experienced surfer.\n\nThe name perfectly captures the wave's tendency to throw perfect, air-filled chambers that few surfers can successfully navigate. The intimate setting and challenging nature create a surf experience that's both terrifying and transformative, where successful rides feel like major accomplishments and wipeouts can be brutal. The spot's exclusivity and quality mean it remains a special destination for those who have earned their place in the lineup, making every session here a cherished memory among the island's surfing elite.",
      "location": {
        "area": "North",
        "nearestTowns": [
          "Majanicho",
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.7410217,
          "lng": -13.9516926,
          "accuracy": "verified"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break",
          "Point Break"
        ],
        "direction": [
          "Right",
          "Left",
          "A-Frame"
        ],
        "directionNotes": "Rights are superior.",
        "bestSwellDirection": [
          "N",
          "NW",
          "NNW",
          "W"
        ],
        "bestWindDirection": [
          "S",
          "SE",
          "SW"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": "Best at Mid and High Tide.",
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works best on a north-northwest groundswell with an offshore south or southeast wind. Waves are powerful and hollow, hitting a triangular lava reef. Holds swells up to 3 meters (10 feet).",
        "abilityLevel": {
          "primary": "Expert",
          "alsoSuitableFor": [
            "Intermediate"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Crowded",
        "crowdNotes": "Can get mobbed.",
        "localVibe": "Competitive, but doable. Respect the locals.",
        "hazards": [
          "Sharp rocks",
          "Heavy waves",
          "Submerged rocks",
          "Strong currents"
        ],
        "bottom": [
          "Lava",
          "Reef",
          "Coral",
          "Rock"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Drive along the North Track; park overlooking the breaks. Access is relatively easy.",
        "parking": "Available, can park a vehicle right by the break.",
        "facilities": "None on site. The nearby villages of Majanicho and Corralejo offer amenities.",
        "paddleOut": "Medium difficulty; use channels to paddle out.",
        "recommendedBoards": [
          "Shortboard",
          "Fish",
          "Gun"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "campo-de-futbol",
      "primaryName": "Campo de Futbol",
      "alternativeNames": [
        "Campo de Futbol La Pared"
      ],
      "description": "Campo de Futbol stands as a regional classic - a reliable reef break that consistently delivers hollow and powerful waves over a flat rock bottom. True to its name, this spot offers long, playing field-like rides when conditions align, attracting advanced surfers who appreciate quality waves without the crowds. The wave breaks in clean sections that provide both steep takeoffs and fast walls, perfect for executing powerful turns and drawing out long carves.\n\nThe wave's reputation for reliability makes it a go-to destination when other spots are inconsistent. Located in La Pared, this gem provides the perfect combination of power and length, working through various tide stages and swell directions. The surrounding landscape creates a dramatic backdrop, with volcanic cliffs framing the playing field of waves below, while offshore winds groom the faces into pristine perfection.\n\nIt rewards surfers with some of the West Coast's most memorable rides in a serene setting where the focus remains purely on the surfing experience. The spot's relative seclusion compared to other La Pared breaks means you'll often find yourself sharing waves with just a handful of dedicated locals who understand the spot's secrets and respect its power.",
      "location": {
        "area": "West",
        "nearestTowns": [
          "La Pared"
        ],
        "coordinates": {
          "lat": 28.231527,
          "lng": -14.215697,
          "accuracy": "verified"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Right",
          "Left"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "NW",
          "W"
        ],
        "bestWindDirection": [
          "E",
          "SE"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": "Best on rising and falling tides.",
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Starts working at less than 1m (3ft) and holds waves up to 3m+ (10ft+). Produces normal to long-length waves (50m to 300m).",
        "abilityLevel": {
          "primary": "Advanced",
          "alsoSuitableFor": []
        }
      },
      "characteristics": {
        "crowdFactor": "Empty",
        "crowdNotes": null,
        "localVibe": "Quiet and often surfed by those in the know. Not a busy, social spot.",
        "hazards": [
          "Rocks"
        ],
        "bottom": [
          "Rock"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Special access. Instant access (<5 minute walk) after parking. Easy to find.",
        "parking": "Park on the dirt track above the cliffs.",
        "facilities": "None. Completely natural surroundings.",
        "paddleOut": "Relatively straightforward from the small beach, but be aware of currents on bigger days.",
        "recommendedBoards": [
          "Shortboard",
          "Step-up"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "cruz-roja",
      "primaryName": "Cruz Roja",
      "alternativeNames": [],
      "description": "Cruz Roja represents Fuerteventura's premier point break - a world-class right-hander at the island's southernmost tip that delivers long, perfectly walling waves worthy of comparison to Australia's Gold Coast legends. Named after the distinctive Red Cross lifeguard house that once stood guard on the beach, this spot serves as the ultimate refuge when western swells overwhelm other breaks. The wave breaks over a combination of sand and volcanic reef that creates consistent shape and power through various tide stages.\n\nThe wave wraps gracefully around the island's southern point, offering powerful yet maneuverable faces that intermediate and advanced surfers dream about. In pristine conditions, Cruz Roja provides some of the longest, most satisfying rides in the Canaries, with sections that can run for hundreds of yards when the swell direction is just right. The wave's unique topography creates both faster sections for racing turns and slower pockets for stylish maneuvers.\n\nIt's well worth the journey to this remote corner of paradise. The spot's location at the southern extremity of the island means it catches swells that other spots miss, while the dramatic coastal setting provides a stunning backdrop to your sessions. The relatively small but dedicated local crew maintains a welcoming atmosphere for respectful visitors, creating a sense of community that's rare at waves of this caliber. The journey through the southern peninsula adds to the adventure, with stunning coastal views building anticipation for what lies around the final bend.",
      "location": {
        "area": "South",
        "nearestTowns": [
          "Morro Jable"
        ],
        "coordinates": {
          "lat": 28.04665398976013,
          "lng": -14.328049421310425,
          "accuracy": "google_maps_verified"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Right",
          "Left"
        ],
        "directionNotes": "Right is primary, occasional short Lefts at the main peak.",
        "bestSwellDirection": [
          "W",
          "NW",
          "S"
        ],
        "bestWindDirection": [
          "N",
          "NW"
        ],
        "bestTide": [
          "Low",
          "Mid"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Spring",
          "Summer",
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works on large west/northwest swells that wrap around the island or on direct south swells from Southern Hemisphere storms. Requires a powerful, long-period swell. The quality of the sandbank is often best when the beach in Morro Jable is at its smallest. Waves can break too close to shore at high tide.",
        "abilityLevel": {
          "primary": "Intermediate",
          "alsoSuitableFor": [
            "Advanced",
            "Beginner"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "High",
        "crowdNotes": "Can get very crowded.",
        "localVibe": "A well-guarded local treasure; can be highly competitive at the main peak, especially with visiting professional surfers in the lineup.",
        "hazards": [
          "Extremely shallow water at the main peak (risk of injury)",
          "Powerful, hollow waves",
          "Crowds and strong local priority"
        ],
        "bottom": [
          "Sand"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "From the main road, park near the 'whale skeleton' landmark. Use the long wooden walkway over the salt marshes to access the beach.",
        "parking": "Available near the beach access point.",
        "facilities": "None on the beach itself.",
        "paddleOut": "Generally easy; paddle out to the far right of the main peak to avoid the breaking waves and use channels.",
        "recommendedBoards": [
          "Shortboard",
          "Funboard / Malibu"
        ],
        "additionalTips": "The main, steeper, and hollow wave is directly in front of the old yellow lifeguard house. Longer, flatter waves break further right. If the main peak is too crowded or intimidating, walk down the beach to the right to find smaller, more forgiving waves. Respect the locals and the lineup hierarchy here; it is strongly enforced on good days."
      }
    },
    {
      "id": "el-burro",
      "primaryName": "El Burro",
      "alternativeNames": [
        "Glass Beach",
        "Playa del Burro",
        "Glasbeach"
      ],
      "description": "El Burro is a spectacular multi-sport destination within the Dunas de Corralejo Natural Park, where pristine white sand beaches meet some of the Northeast's most versatile waves. This stunning location features crystal-clear waters and dramatic dunes that create an unforgettable backdrop for surfing adventures.\n\nThe spot offers perfect duality - a powerful A-frame reef break over lava shelf challenges advanced surfers with hollow sections, while the broader beach area provides forgiving waves perfect for progression. As a hub for surfing, windsurfing, and kitesurfing, El Burro buzzes with energy.\n\nThe main peak sees friendly competition that keeps the atmosphere exciting. The reef handles sizeable northwest swells beautifully, while summer offshore winds transform the waves into pristine machines.",
      "location": {
        "area": "North East",
        "nearestTowns": [
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.68748491452675,
          "lng": -13.830869190270791,
          "accuracy": "google_maps_verified"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break",
          "Beach Break"
        ],
        "direction": [
          "Left",
          "Right",
          "A-Frame"
        ],
        "directionNotes": "A-frame on the reef.",
        "bestSwellDirection": [
          "NE",
          "N",
          "NW"
        ],
        "bestWindDirection": [
          "W",
          "NW"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": "Reef is best from Mid to Low Tide.",
        "bestSeason": [
          "Spring",
          "Summer"
        ],
        "idealConditions": "The reef break is most surfed in summer with northeast wind swells, working from knee to double overhead. It offers clean, lined-up waves. Best surfed in the morning and evening before windsurfers and kitesurfers take over when the trade wind picks up in the afternoon.",
        "abilityLevel": {
          "primary": "Intermediate",
          "alsoSuitableFor": [
            "Beginner",
            "Advanced"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "High",
        "crowdNotes": null,
        "localVibe": "Popular with surf schools and international surfers; can be competitive and vocal at the main reef peak, especially on good days.",
        "hazards": [
          "Sharp lava reef",
          "Strong currents",
          "Urchins",
          "Windsurfers/Kitesurfers"
        ],
        "bottom": [
          "Sand",
          "Lava",
          "Reef"
        ],
        "waterQuality": "Clean, crystalline"
      },
      "practicalities": {
        "access": "Easily accessible by car, located off the main road near Corralejo. Park along the road, but be cautious as the sand can be dangerously soft.",
        "parking": "Easy parking alongside the road.",
        "facilities": "Lifeguard service. Stone wind shelters ('corralitos') on the beach. Bars, restaurants, and several surf schools offering lessons and equipment rental are nearby.",
        "paddleOut": "Use the narrow channel on the right side of the bay to paddle out without fighting waves.",
        "recommendedBoards": [
          "Shortboard",
          "Fish",
          "Funboard / Malibu"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "el-cotillo-piedra-playa",
      "primaryName": "El Cotillo",
      "alternativeNames": [
        "Piedra Playa",
        "Cotillo Beach"
      ],
      "description": "A magnificent stretch of coastline featuring a very long sandy beach with multiple peaks offering both left and right breaks. This powerful beach break showcases its true character when winter swells arrive, transforming the sandbanks into perfectly shaped barreling sections that will have experienced surfers grinning from ear to ear.\n\nThe north end cliffs provide natural protection from northerly winds, creating cleaner conditions when other spots are blown out. While this beach can deliver challenging overhead waves that test even advanced surfers, it's also incredibly versatile.\n\nBeginners can find their groove in the forgiving whitewater, making it an ideal learning environment. The beauty of El Cotillo lies in its year-round consistency - as long as you catch it on the right swell and tide, you're in for an unforgettable session.",
      "location": {
        "area": "West",
        "nearestTowns": [
          "El Cotillo"
        ],
        "coordinates": {
          "lat": 28.6742,
          "lng": -14.0076,
          "accuracy": "unverified"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "N",
          "NW",
          "W"
        ],
        "bestWindDirection": [
          "E",
          "NE"
        ],
        "bestTide": [
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Spring",
          "Summer",
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works all year if not too big or small. Banks improve after winter scouring. White water ideal for beginners - no paddle out needed.",
        "abilityLevel": {
          "primary": "Beginner",
          "alsoSuitableFor": [
            "Intermediate",
            "Advanced"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Medium",
        "crowdNotes": "Popular with surf schools.",
        "localVibe": "Varied peaks spread crowds.",
        "hazards": [
          "Close-outs on big days",
          "Strong currents"
        ],
        "bottom": [
          "Sand"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Easy access from El Cotillo town",
        "parking": "Multiple parking areas along beach",
        "facilities": "All amenities in El Cotillo town",
        "paddleOut": "Easy in white water; challenging on big days",
        "recommendedBoards": [
          "Funboard / Malibu",
          "Shortboard",
          "Beginner Board / Soft-top"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "playa-del-moro",
      "primaryName": "Playa del Moro",
      "alternativeNames": [
        "El Moro Beach"
      ],
      "description": "Nestled within the protected Corralejo Dunes Natural Park, this stunning 250-meter stretch of golden-white sand offers one of Fuerteventura's most welcoming surf experiences. The gentle, reliable beach break has made this spot a firm favorite among surf schools and beginners looking to catch their first waves in a safe, supervised environment.\n\nWhat makes Playa del Moro special is its family-friendly atmosphere and thoughtful organization - the beach is divided into designated zones for swimmers and surfers, with vigilant lifeguards keeping watch over everyone's safety. The crystal-clear waters and pristine sand create a tropical paradise vibe that's hard to beat.\n\nWhile this spot truly comes alive during the summer months when northeast wind swells provide perfect learning conditions, it's a year-round destination for those seeking to improve their skills in a beautiful, protected setting.",
      "location": {
        "area": "North East",
        "nearestTowns": [
          "Corralejo",
          "Lajares"
        ],
        "coordinates": {
          "lat": 28.67396394001897,
          "lng": -13.833475042758906,
          "accuracy": "google_maps_verified"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "NE",
          "N"
        ],
        "bestWindDirection": [
          "W",
          "NW",
          "N"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": "Best at Medium to Low Tide.",
        "bestSeason": [
          "Spring",
          "Summer"
        ],
        "idealConditions": "Works consistently with northern or eastern wind swells, making it reliable in the summer trade wind season. Waves are less powerful than other spots, perfect for learning. Rarely works in winter as it needs a huge northwest swell.",
        "abilityLevel": {
          "primary": "Beginner",
          "alsoSuitableFor": [
            "Intermediate"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Crowded",
        "crowdNotes": "Very crowded in peak season with surf schools, but can be empty in off-season.",
        "localVibe": "Friendly and instructional, but busy; strictly enforced zones for surfers and swimmers.",
        "hazards": [
          "Strong currents (especially on the sides)",
          "Rocks (visible at low tide)",
          "Busy lineup"
        ],
        "bottom": [
          "Sand",
          "Rock"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Easy access directly from the main road (FV-1).",
        "parking": "Good parking available directly by the beach.",
        "facilities": "Lifeguard on duty. The beach is divided into designated zones for swimmers and surfers.",
        "paddleOut": "Easy, as the beach slopes gently and waves are less powerful. Minimal paddling required.",
        "recommendedBoards": [
          "Beginner Board / Soft-top",
          "Longboard",
          "Funboard / Malibu"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "el-muelle",
      "primaryName": "El Muelle",
      "alternativeNames": [
        "Harbour Wall"
      ],
      "description": "Right in the heart of Corralejo, this reliable left-hand point break delivers some of the most consistent surf on the island, wrapping along the harbor wall with long, mesmerizing rides that seem to go on forever. The wave's legendary reputation draws a regular crowd, but for good reason - when conditions align, El Muelle serves up pure magic.\n\nThe main attraction is a spectacular left-hander that offers a super long shoulder perfect for stylish carves and drawn-out bottom turns. However, this spot demands respect - beneath the shimmering surface lies a sharp lava reef that shows no mercy, especially at high tide when the left becomes dangerously unforgiving. Smart surfers either wait for lower tides or switch to the shorter right-hand wave that peaks up when the water covers the reef.\n\nEl Muelle truly shines during the winter months when west swells march in, creating those picture-perfect walls that locals and visiting surfers dream about.",
      "location": {
        "area": "North",
        "nearestTowns": [
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.746074921053435,
          "lng": -13.864985902108891,
          "accuracy": "google_maps_improved"
        }
      },
      "waveDetails": {
        "type": [
          "Point Break",
          "Reef Break"
        ],
        "direction": [
          "Left"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "N",
          "NW",
          "NNW"
        ],
        "bestWindDirection": [
          "S",
          "SW"
        ],
        "bestTide": [
          "Low",
          "Mid"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Winter"
        ],
        "idealConditions": "Works best on a north-northwest groundswell with an offshore south or south-west wind. Most consistent in winter, with December being the peak month.",
        "abilityLevel": {
          "primary": "Advanced",
          "alsoSuitableFor": []
        }
      },
      "characteristics": {
        "crowdFactor": "High",
        "crowdNotes": null,
        "localVibe": "Can be competitive due to its location and consistency.",
        "hazards": [
          "Rocks",
          "Sharp reef",
          "Corals",
          "Urchins"
        ],
        "bottom": [
          "Reef",
          "Coral",
          "Rock"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Easy access in Corralejo town. From the harbour, follow the path that heads north away from it.",
        "parking": "Street parking available nearby.",
        "facilities": "Facilities of Corralejo nearby, including 'cafe la ola' right in front of the spot.",
        "paddleOut": "Enter the water where the harbour defences end and a large slab rock sticks out of the ground.",
        "recommendedBoards": [
          "Shortboard"
        ],
        "additionalTips": "Booties are highly recommended due to the sharp reef and corals. The wave can hold up to 3m (10ft) and offers long rides of 50m to over 150m."
      }
    },
    {
      "id": "el-pozo",
      "primaryName": "El Pozo",
      "alternativeNames": [],
      "description": "The southernmost sentinel of Fuerteventura's surfing coastline, El Pozo commands a premium position directly in front of the iconic Jandía lighthouse at the island's very tip. This strategic location creates perfect conditions for clean, wind-swell-generated left-hand waves that benefit from consistent offshore winds, establishing El Pozo as the ultimate summer favorite when other spots struggle. The lighthouse isn't just a landmark - it's the spot's defining feature, creating unique coastal geometry that shapes exceptional waves.\n\nEl Pozo offers remarkable wave versatility that caters to different skill levels and riding styles. Immediately in front of the lighthouse, a hollow and steep section develops, producing perfect tube opportunities for advanced surfers seeking that dream barrel. Further down the beach, the wave transforms into longer, gentler walls that provide ideal practice grounds for intermediates and endless fun for longboarders. This natural progression within one spot makes El Pozo uniquely accommodating, offering everything from high-performance tube riding to mellow cruising sessions.\n\nWhat truly elevates El Pozo above other southern spots is its remarkable reliability during summer months, when consistent offshore winds groom wind swells into pristine left-handers. The spot's unique positioning provides natural wind protection while maintaining wave quality that rarely falls flat. The iconic Jandía lighthouse serves not just as a navigational aid but as a symbol of the spot's premium status - this is where Fuerteventura's surfing journey begins or ends, depending on your perspective, making it an essential destination for any surfer exploring the island's southern reaches.",
      "location": {
        "area": "South",
        "nearestTowns": [
          "Morro Jable"
        ],
        "coordinates": {
          "lat": 28.0657,
          "lng": -14.5071,
          "accuracy": "verified"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": "Left is primary, occasional short/hollow Rights.",
        "bestSwellDirection": [
          "NE"
        ],
        "bestWindDirection": [
          "NE"
        ],
        "bestTide": [
          "Low",
          "Mid"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Spring",
          "Summer"
        ],
        "idealConditions": "Requires a strong, consistent northeasterly wind (the trade winds) blowing for several days to generate a clean wind swell. The unique geography makes this wind offshore, creating groomed, surfable waves. Does not work well at high tide.",
        "abilityLevel": {
          "primary": "Intermediate",
          "alsoSuitableFor": [
            "Advanced",
            "Beginner"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Medium",
        "crowdNotes": "Can get crowded, especially at the main peak in summer.",
        "localVibe": "Popular and lively in summer; the main peak can be competitive.",
        "hazards": [
          "Powerful shorebreak/shallow sandbank at main peak",
          "Longshore current (pulls south towards Morro Jable)"
        ],
        "bottom": [
          "Sand"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Very easy access. Drive to the Jandía lighthouse and park nearby. A wooden footbridge leads from the parking area across the salt marshes to the beach.",
        "parking": "Available near the lighthouse.",
        "facilities": "Easy access to the amenities of Morro Jable.",
        "paddleOut": "Generally easy. Be mindful of the longshore current.",
        "recommendedBoards": [
          "Shortboard",
          "Fish"
        ],
        "additionalTips": "The wave character changes along the beach. The hollowest and most powerful section is directly in front of the lighthouse, ideal for advanced maneuvers. For a more relaxed session, surf the longer, gentler lefts further to the left (south) of the lighthouse. The current runs parallel to the beach, so keep an eye on your position."
      }
    },
    {
      "id": "spew-pits",
      "primaryName": "Spew Pits",
      "alternativeNames": [
        "El Puertito"
      ],
      "description": "Spew Pits, known locally as 'El Puertito' (the little port), stands as one of Fuerteventura's most formidable big-wave arenas located just outside the old harbor of El Cotillo. This fearsome, exposed reef break has earned its terrifying reputation through decades of producing powerful, heavy waves that test the limits of even the most experienced surfers.\n\nThe spot's strategic harbor position creates perfect exposure for massive north-west swells, transforming into a world-class big-wave venue that has hosted prestigious competitions. When Spew Pits comes alive, it delivers monstrous barreling sections over a shallow, treacherous reef that demands absolute respect and precise local knowledge.\n\nThis is not a place for mistakes - the powerful reef break produces heavy, unforgiving waves that can reach terrifying sizes, making it suitable only for expert big-wave surfers with serious commitment to safety and skill.",
      "location": {
        "area": "West",
        "nearestTowns": [
          "El Cotillo"
        ],
        "coordinates": {
          "lat": 28.685571149327316,
          "lng": -14.0138179063797,
          "accuracy": "google_maps_verified"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Right",
          "Left"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "NW"
        ],
        "bestWindDirection": [
          "NE"
        ],
        "bestTide": [
          "Mid",
          "High"
        ],
        "tideNotes": "Works best on a fuller tide to cover the reef.",
        "bestSeason": [
          "Autumn",
          "Winter",
          "Spring"
        ],
        "idealConditions": "Needs a huge NW swell combined with northeasterly (NE) offshore winds. Works best in the winter months when large Atlantic swells arrive.",
        "abilityLevel": {
          "primary": "Expert",
          "alsoSuitableFor": []
        }
      },
      "characteristics": {
        "crowdFactor": "Medium",
        "crowdNotes": "Can be crowded with experts on big days.",
        "localVibe": "Serious big-wave spot; reserved for highly skilled surfers.",
        "hazards": [
          "Very shallow reef",
          "Rocks",
          "Heavy waves",
          "Dangerous rips",
          "Life-threatening conditions"
        ],
        "bottom": [
          "Reef",
          "Rock"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Located just outside the old harbour of El Cotillo.",
        "parking": "Parking available in and around the old harbour of El Cotillo.",
        "facilities": "All facilities of El Cotillo town are nearby.",
        "paddleOut": "A pretty hefty paddle from the shore, often against strong currents.",
        "recommendedBoards": [
          "Gun",
          "Step-up",
          "Shortboard"
        ],
        "additionalTips": "This is not a spot for beginners or intermediates. The conditions are life-threatening for those without the requisite skill and local knowledge. On its biggest days, it has been compared to a mini-Nazare."
      }
    },
    {
      "id": "esquinzo-jandia",
      "primaryName": "Esquinzo (Jandía)",
      "alternativeNames": [
        "Playa de Esquinzo",
        "Esquinzo Este"
      ],
      "description": "A gentle and picturesque beach break gracing the eastern coastline of the Jandía peninsula, tucked beneath a charming tourist settlement where the waves seem to dance to their own peaceful rhythm. This slice of paradise is renowned for crafting long, mellow left-handers that flow endlessly, powered by reliable northeasterly wind swells that create those dreamy, cinematic rides straight out of classic surf films.\n\nWhat makes Esquinzo (Jandía) truly special is its welcoming nature - this is one of those rare spots where everyone feels at home. Beginners find their confidence here with forgiving, rolling waves, longboarders relish the endless shoulder time, and families appreciate the safe, clean environment free from major hazards. The protected bay creates a natural sanctuary where conditions remain consistently surfable throughout the year.\n\nThe dramatic cliffs that frame this bay don't just provide stunning backdrops - they offer valuable protection from northeast winds while helping to organize swells into those perfectly peeling lefts that seem to go on forever. It's the kind of spot that reminds you why you fell in love with surfing in the first place.",
      "location": {
        "area": "South",
        "nearestTowns": [
          "Esquinzo",
          "Butihondo"
        ],
        "coordinates": {
          "lat": 28.078962392622064,
          "lng": -14.294627083397355,
          "accuracy": "google_maps_verified"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Left"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "NE",
          "E"
        ],
        "bestWindDirection": [
          "NE",
          "E"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Spring",
          "Summer"
        ],
        "idealConditions": "Requires a consistent northeasterly wind above 20 knots blowing for at least 1.5 days to generate a clean wind swell. The wave is almost always offshore here. Best for longboards and funboards; only works for shortboards on the biggest days.",
        "abilityLevel": {
          "primary": "Beginner",
          "alsoSuitableFor": [
            "Intermediate",
            "Longboarder"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Low",
        "crowdNotes": "Rarely crowded.",
        "localVibe": "Relaxed and family-friendly; popular with learners.",
        "hazards": [
          "Longshore current (parallel to beach)",
          "Very shallow water at the end of the wave",
          "Knee-deep dismounts"
        ],
        "bottom": [
          "Sand"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Easily visible from the highway viaduct. Take the Butihondo exit, drive towards the village of Esquinzo, and follow a small road to the natural park above the beach.",
        "parking": "Can park at the edge of the bay or at a small car park directly on the beach.",
        "facilities": "A supermarket is located in Esquinzo village, directly across from the access road.",
        "paddleOut": "Very easy.",
        "recommendedBoards": [
          "Longboard",
          "Funboard / Malibu",
          "Fish"
        ],
        "additionalTips": "Watch for a longshore current that runs from north to south; use landmarks on the beach to avoid drifting away from the peak. Dismount from your board carefully as the waves break in very shallow water. Advanced surfers take off near the stony headland, while beginners should position themselves further right in the bay."
      }
    },
    {
      "id": "esquinzo",
      "primaryName": "Esquinzo",
      "alternativeNames": [
        "Playa de Esquinzo"
      ],
      "description": "A stunning beach break nestled below a charming tourist settlement, where the waves paint picture-perfect left-hand lines that could be lifted straight from classic surf films. This hidden gem thrives on consistent wind swells, creating those long, flowing rides that beginners and longboarders dream about, making it an absolute favorite for surfers seeking gentle, forgiving conditions.\n\nThe true magic of Esquinzo lies in its dramatic setting - massive cliffs form a natural amphitheater that provides shelter from pesky northeast winds while creating a protected bay where waves can organize into perfect, peeling lefts. When the conditions align, you'll find rides here that seem to stretch forever, often longer than what you'll find at the more famous El Cotillo.\n\nLike any quality spot, respect is paramount here. When it's firing and crowded, take a moment to observe and understand the local vibe before jumping in. The rewards are worth it - this spot can deliver good rides at any time of year, making it a reliable go-to when you need that perfect, soulful session.",
      "location": {
        "area": "South",
        "nearestTowns": [
          "Costa Calma",
          "Butihondo",
          "Morro Jable"
        ],
        "coordinates": {
          "lat": 28.6347996,
          "lng": -14.0267086,
          "accuracy": "google_maps_corrected"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Left"
        ],
        "directionNotes": "Primary left.",
        "bestSwellDirection": [
          "W",
          "NW"
        ],
        "bestWindDirection": [
          "E",
          "NE"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": "Best at high tide.",
        "bestSeason": [
          "Winter",
          "Spring",
          "Summer"
        ],
        "idealConditions": "Works best on wind swells generated by northeasterly winds blowing consistently above 20 knots for over a day. Waves are particularly clean due to frequent offshore winds.",
        "abilityLevel": {
          "primary": "Beginner",
          "alsoSuitableFor": [
            "Intermediate",
            "Longboarder"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Low",
        "crowdNotes": "Rarely crowded.",
        "localVibe": "Popular with surf schools and families",
        "hazards": [
          "Current parallel to beach",
          "Shallow water at wave end"
        ],
        "bottom": [
          "Sand"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Visible from the highway viaduct. Take the Butihondo exit, head towards Esquinzo village, and follow a small road to the natural park above the beach.",
        "parking": "Available at the bay's edge or a small car park directly on the beach",
        "facilities": "Supermarket nearby in Esquinzo village",
        "paddleOut": "Easy",
        "recommendedBoards": [
          "Longboard",
          "Funboard / Malibu",
          "Fish"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "flag-beach",
      "primaryName": "Flag Beach",
      "alternativeNames": [
        "Kite Beach"
      ],
      "description": "The crown jewel of Fuerteventura's kitesurfing scene, Flag Beach reigns as probably the island's most popular watersports destination. This spectacular mile-long stretch marks the northern tip where Corralejo begins, offering a vast sandy playground directly opposite the Isle of Lobos with stunning views of Lanzarote. The beach features a dedicated 3km kite zone that creates flat water conditions in summer, making it the ultimate hub for kitesurfers, windsurfers, and wing-foilers.\n\nBeyond its kite surfing fame, Flag Beach delivers versatile surfing conditions with protected bay geography thanks to reefs flanking both sides. The turquoise waters and consistent winds create an ideal environment for multiple watersports, while the massive dune system provides a dramatic backdrop. Professional windsurf and kitesurf centers line the shore, offering lessons and equipment for all skill levels from beginners to advanced riders seeking to perfect their techniques.\n\nWhat truly sets Flag Beach apart is its accessibility and natural beauty. A short 60-meter walk across the dunes leads to the sea, where the protected environment creates user-friendly conditions rarely found elsewhere. The spot's unique position at the island's northeastern corner provides consistent wind patterns while the offshore Isle of Lobos creates a natural windbreak, resulting in those coveted flat water sections that make this a world-class destination for freestyle enthusiasts and learners alike.",
      "location": {
        "area": "North East",
        "nearestTowns": [
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.7125,
          "lng": -13.8423,
          "accuracy": "verified"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "NW",
          "N",
          "NE"
        ],
        "bestWindDirection": [
          "N",
          "NW"
        ],
        "bestTide": [
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Spring",
          "Summer",
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works on north and northwest swells. The bay is moderated and less intense than other spots. The wind, which is sideshore from the left (NE), typically arrives in the afternoon. Best surfed at mid to high tide to avoid exposed rocks.",
        "abilityLevel": {
          "primary": "Intermediate",
          "alsoSuitableFor": [
            "Beginner"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Medium",
        "crowdNotes": "Popular with multiple water sports.",
        "localVibe": "Lively and shared; priority must be given to kite and windsurfers on windy days.",
        "hazards": [
          "Rocks at low tide",
          "Kite and windsurfing lines",
          "Occasional shorebreak on swells"
        ],
        "bottom": [
          "Sand",
          "Reef"
        ],
        "waterQuality": "Clean, turquoise"
      },
      "practicalities": {
        "access": "Easy access. Park directly by the road and carry your equipment about 150m to the beach.",
        "parking": "Available along the road",
        "facilities": "A small beach bar and a dedicated windsurf/kitesurf center with equipment rental and lessons. No other infrastructure like public toilets.",
        "paddleOut": "Generally easy with a gentle slope and a light shorebreak, but can be challenging with winter swells.",
        "recommendedBoards": [
          "Funboard / Malibu",
          "Shortboard"
        ],
        "additionalTips": "Surf booties are recommended due to stones in the water and rocks that are exposed at low tide. This is primarily a wind sport spot, so be highly aware of kiters and windsurfers, and yield to them on windy days."
      }
    },
    {
      "id": "generoso",
      "primaryName": "Generoso",
      "alternativeNames": [
        "La Generosa",
        "Genarosa"
      ],
      "description": "Generoso offers a perfectly balanced introduction to Fuerteventura's North Shore reef breaks, delivering long, forgiving waves that build confidence without intimidation. This dependable spot produces mellow lefts and rights that make it ideal for intermediates transitioning from beach breaks to reef surfing.\n\nLocated in a prime position along the North Shore between Corralejo and Majanicho, Generoso picks up west swells beautifully and transforms into surprisingly fun rides when bigger swells energize the break. The spot's gentle nature and consistent performance during winter months make it a favorite for progression sessions, while its name meaning 'generous' perfectly captures the welcoming spirit of the waves.\n\nSurfers appreciate the relaxed atmosphere and the opportunity to practice reef surfing skills in a user-friendly environment that still delivers the occasional exciting boost of power. The uncrowded lineup and friendly vibe make it the perfect classroom for mastering reef techniques without pressure, creating memorable learning experiences in a stunning natural setting.",
      "location": {
        "area": "North",
        "nearestTowns": [
          "Corralejo",
          "Majanicho"
        ],
        "coordinates": {
          "lat": 28.755806057680825,
          "lng": -13.885355746299574,
          "accuracy": "google_maps_confirmed"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": "Lefts are superior.",
        "bestSwellDirection": [
          "N",
          "NW",
          "W",
          "NNW"
        ],
        "bestWindDirection": [
          "S",
          "SW"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": "Best from low to mid.",
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works best on a north-northwest groundswell with an offshore south or south-west wind. A dependable spot that works at all stages of the tide.",
        "abilityLevel": {
          "primary": "Intermediate",
          "alsoSuitableFor": [
            "Advanced"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Medium",
        "crowdNotes": "Sometimes crowded.",
        "localVibe": "Can be busy, especially on weekends",
        "hazards": [
          "Rocks in lineup",
          "Sharp reef",
          "Corals",
          "Shallow sections at low tide"
        ],
        "bottom": [
          "Reef",
          "Coral",
          "Rock"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Accessed via a dirt road off the north shore route.",
        "parking": "Informal parking along the North Shore dirt track.",
        "facilities": "None. Nearest facilities are in Corralejo.",
        "paddleOut": "There are a few keyhole channels through the reef. Watch others to find the safest entry point.",
        "recommendedBoards": [
          "Shortboard",
          "Funboard / Malibu"
        ],
        "additionalTips": "Holds swell up to 3m (10ft). The left-hand wave works best from low to mid tide. Be careful of nasty rocks at low tide."
      }
    },
    {
      "id": "cofete-graveyard",
      "primaryName": "Cofete",
      "alternativeNames": [
        "Playa de Cofete",
        "Graveyard",
        "Cofete Beach"
      ],
      "description": "The crown jewel of Fuerteventura's wild coastline, Cofete represents surfing in its most raw and untamed form. This vast, breathtakingly beautiful beach stretches along the remote Jandía peninsula, consistently ranked among the world's most spectacular coastal destinations. As the longest and most isolated beach on Fuerteventura, Cofete offers an unparalleled sense of freedom, backed by majestic mountains that create a dramatic natural amphitheater and featuring the mysterious Villa Winter that adds an air of intrigue to this already legendary location.\n\nCofete's surfing potential matches its natural grandeur through an endless series of shifting sandbanks that provide left and right-hand beach breaks along its extensive length. The spot's alternative name \"Graveyard\" hints at its more sinister side - treacherous currents and massive waves that demand respect from all who enter. This dual personality creates a unique surfing experience: mellow beach breaks for those seeking solitude and perfect peaks, alongside powerful sections that can deliver serious consequences to the unprepared. The beach's sheer size ensures an empty peak for those willing to make the arduous journey.\n\nReaching Cofete is an adventure in itself, accessible only via a challenging dirt road that winds through mountains, effectively creating a natural barrier that preserves the beach's pristine isolation. This journey transforms a surf session into a true expedition, where the reward is perfect waves in one of nature's most spectacular settings. The combination of raw power, profound solitude, and stunning beauty makes Cofete more than just a surf spot - it's a pilgrimage destination for those seeking the ultimate escape from civilization and a connection with the ocean in its most untamed state.",
      "location": {
        "area": "South",
        "nearestTowns": [
          "Morro Jable"
        ],
        "coordinates": {
          "lat": 28.108931801947506,
          "lng": -14.388742446899414,
          "accuracy": "google_maps_corrected"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "NW",
          "W"
        ],
        "bestWindDirection": [
          "E",
          "SE"
        ],
        "bestTide": [
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Spring",
          "Summer",
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works on northwest swells. Contrary to myth, the waves are not bigger than other west coast spots, but are often compared to powerful French beach breaks. The real advantage is the countless empty sandbanks. The bay is sheltered from the wind by the high mountains, often making it less windy than other west coast spots. Best from mid to high tide; can close out at low tide.",
        "abilityLevel": {
          "primary": "Advanced",
          "alsoSuitableFor": [
            "Expert"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Empty",
        "crowdNotes": "Very low, often completely alone.",
        "localVibe": "Majestic, pristine, and isolated. A spot for adventure and solitude.",
        "hazards": [
          "Extreme isolation (No lifeguards, no quick emergency services)",
          "Powerful shorebreak",
          "Strong longshore and rip currents",
          "Waves are consistently more powerful than they appear from the beach"
        ],
        "bottom": [
          "Sand"
        ],
        "waterQuality": "Clean, azure blue"
      },
      "practicalities": {
        "access": "A serious undertaking. A 4x4 vehicle is highly recommended for the 16km rough, unmaintained gravel road. From Morro Jable, follow signs for the cemetery ('Cementerio'). The road winds over a mountain pass (with a viewing point and telescope) before a steep, narrow descent to the beach. Honk on blind corners.",
        "parking": "Large car park at the end of the road, a short walk from the beach.",
        "facilities": "None on the beach. In the village of Cofete, there is a bar serving tapas and a small historical exhibition.",
        "paddleOut": "Varies with the shifting sandbanks. Be aware of strong currents running parallel to the beach and between sandbanks.",
        "recommendedBoards": [
          "Shortboard",
          "Step-up"
        ],
        "additionalTips": "This is not a beginner spot due to the isolation and power. You are entirely self-reliant. Honestly assess conditions and your ability before entering the water. The drive is an adventure in itself. Explore the history of the original settlement and the mysterious Villa Winter."
      }
    },
    {
      "id": "la-caleta-boneyard",
      "primaryName": "La Caleta",
      "alternativeNames": [
        "Boneyard"
      ],
      "description": "La Caleta stands as one of Fuerteventura's most spectacular reef breaks, delivering world-class left-handers that seem to go on forever. When this spot is firing, you'll find perfectly shaped walls that peel endlessly along the volcanic reef, offering plenty of opportunities for explosive aerial maneuvers and stylish carves. The wave face remains consistently smooth and predictable, allowing surfers to link multiple sections and truly express their style on one of the island's most canvassed waves.\n\nThe magic here lies in the deep channel that creates a natural escape route and ensures waves never close out, even when the swell builds to intimidating double mast-high proportions. This is a serious wave for experienced surfers seeking that perfect, long-running left that Fuerteventura's north coast is famous for. The wave's unique topography creates multiple speed zones where you can generate momentum for massive turns or floaters.\n\nGetting to La Caleta requires dedication and local knowledge, which helps keep crowds to a minimum even during peak season. The rugged coastline provides a stunning backdrop to your session, with crystal-clear waters offering glimpses of the reef below. The isolation adds to the experience - you're truly out there in raw nature, far from the island's more tourist-centric breaks, trading convenience for world-class quality and the chance to score perfect waves with just a few friends.",
      "location": {
        "area": "North",
        "nearestTowns": [
          "Corralejo",
          "Majanicho"
        ],
        "coordinates": {
          "lat": 28.7530244,
          "lng": -13.9232826,
          "accuracy": "google_maps_corrected"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": "Left is primary, Right is inside bay.",
        "bestSwellDirection": [
          "N",
          "NW"
        ],
        "bestWindDirection": [
          "E",
          "NE"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter",
          "Spring"
        ],
        "idealConditions": "Works on north swells. Outside wave handles any size; inside bay wave works when outside is too big or choppy. Wind blocked by coast in first section.",
        "abilityLevel": {
          "primary": "Intermediate",
          "alsoSuitableFor": [
            "Advanced",
            "Beginner"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Medium",
        "crowdNotes": "Can be crowded.",
        "localVibe": "World-class wave attracting good surfers.",
        "hazards": [
          "Rocks at entry",
          "Powerful waves on big days"
        ],
        "bottom": [
          "Reef"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "East of Majanicho, accessible via dirt roads",
        "parking": "Available near spot",
        "facilities": "None at spot",
        "paddleOut": "Tricky entry over rocks into flat water; deep channel",
        "recommendedBoards": [
          "Shortboard",
          "Performance Board"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "la-concava",
      "primaryName": "La Concava",
      "alternativeNames": [
        "Lazy's",
        "Concavas"
      ],
      "description": "Tucked away inside the protected waters of Mejillones Bay, La Concava is a deceptively powerful reef break that earned its nickname 'Lazy's' not from a lack of intensity, but because the wave does all the work for you. This hollow, machine-like left-hander reels across a shallow volcanic reef, delivering perfect barrel sections with minimal paddling effort required. The wave's mechanical precision and reliable shape make it a favorite among advanced surfers seeking technical perfection.\n\nWhen the west swell lines up just right, this spot transforms into a tube-riding paradise where skilled surfers can get desperately pitted. The wave's shallow nature makes it notoriously unforgiving on equipment – hence its reputation as a board-breaker – but for expert surfers seeking perfect, technical barrels, La Concava offers an intimate and thrilling experience away from the crowds. The wave consistently throws over the shallow reef, creating cavernous sections that test even the most experienced tube riders.\n\nWhat truly sets La Concava apart is its combination of accessibility and consequence. The spot's location within the larger bay provides some protection from harsh conditions, yet the wave itself remains raw and powerful. The intimate setting means you're often sharing this special wave with just a handful of locals who understand its nuances. On good days, the atmosphere is electric as skilled surfers push their limits in pursuit of the perfect barrel, creating a spectacle that showcases the very essence of high-performance surfing in the Canaries.",
      "location": {
        "area": "North",
        "nearestTowns": [
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.7415,
          "lng": -13.9353,
          "accuracy": "unverified"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "W"
        ],
        "bestWindDirection": [
          "SW"
        ],
        "bestTide": [
          "Mid"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works best with a firm west swell and south-west offshore wind. The wave is known for being a 'board snapper' due to the shallow reef and powerful breaks.",
        "abilityLevel": {
          "primary": "Expert",
          "alsoSuitableFor": []
        }
      },
      "characteristics": {
        "crowdFactor": "Medium",
        "crowdNotes": "Can be crowded when conditions are good.",
        "localVibe": "Respectful but serious; reserved for experienced surfers.",
        "hazards": [
          "Very shallow reef",
          "Sharp lava rock",
          "Strong currents",
          "Board damage"
        ],
        "bottom": [
          "Reef",
          "Lava"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Located along the North Track; accessible by car.",
        "parking": "Available along the track",
        "facilities": "None",
        "paddleOut": "Very difficult and dangerous. Requires a jump from the rocks into a deep channel with precise timing. Not for the inexperienced.",
        "recommendedBoards": [
          "Shortboard",
          "Step-up"
        ],
        "additionalTips": "This is not a spot for beginners or intermediates. Proper assessment of conditions and personal skill is crucial due to the high risk of injury and board damage."
      }
    },
    {
      "id": "la-derecha-de-los-alemanes",
      "primaryName": "La Derecha de los Alemanes",
      "alternativeNames": [
        "La Derecha",
        "Germans' Right",
        "The German Right",
        "Hierro"
      ],
      "description": "La Derecha de los Alemanes, affectionately known as 'German's Right,' stands as one of Fuerteventura's most consistent and beloved north shore waves. This exposed right-hander has an incredible ability to catch swell from almost any direction, making it the go-to spot when other breaks are going flat. On its day, the wave delivers steep, powerful walls that can offer mind-blowing barrel sections and rides stretching up to 150 meters along the volcanic reef.\n\nWhat makes this spot truly special is its reliability – when massive west swells are closing out everywhere else, German's Right often remains perfectly surfable. The wave breaks in front of a beautiful sandy beach, creating a stunning backdrop and making it equally popular with sunbathers as it is with surfers. While weekends can bring a dedicated crowd, the quality of the wave and the potential for long, fulfilling rides make it well worth sharing.\n\nThe wave's accessibility combined with its quality creates a unique surf experience that appeals to both intermediate and advanced surfers. The presence of a sandy bottom in some sections provides safer landings than typical reef breaks, while the consistency means you can build confidence through repeated sessions. The mix of local and visiting surfers creates an international atmosphere where different surfing styles converge, while the beach setting allows for extended sessions with the option to rest and watch other surfers between sets.",
      "location": {
        "area": "North",
        "nearestTowns": [
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.738873060588595,
          "lng": -13.954840799932198,
          "accuracy": "google_maps_improved"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "N",
          "NW",
          "NNW"
        ],
        "bestWindDirection": [
          "S",
          "SE"
        ],
        "bestTide": [
          "Low",
          "Mid"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works best on a north to northwest groundswell with an offshore south or southeasterly wind. A dependable spot that holds waves up to 2.5 meters (8 feet). The wave can get soft and more suitable for longboards at high tide.",
        "abilityLevel": {
          "primary": "Intermediate",
          "alsoSuitableFor": [
            "Advanced"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Crowded",
        "crowdNotes": "Especially on weekends.",
        "localVibe": "Popular and can be busy, but generally tolerable.",
        "hazards": [
          "Strong currents",
          "Rocks",
          "Sharp reef",
          "Long paddle-out"
        ],
        "bottom": [
          "Reef",
          "Coral",
          "Rock"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Located east of Majanicho, accessible via a dirt road.",
        "parking": "Informal parking on the dirt track overlooking the break.",
        "facilities": "None. Bring all supplies.",
        "paddleOut": "Long paddle-out is required.",
        "recommendedBoards": [
          "Shortboard",
          "Funboard / Malibu",
          "Longboard"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "la-entubadera",
      "primaryName": "La Entubadera",
      "alternativeNames": [
        "Playa del Viejo"
      ],
      "description": "Tucked away in the protected beauty of Corralejo Natural Park, La Entubadera offers a powerful and unique surfing experience that comes alive when winter swells dominate the island. This beach break works over a sand-covered volcanic reef, creating perfect A-frame peaks that can deliver some of the most satisfying tube sections on the north coast. The wave's true character reveals itself when the main north shore spots become too large to handle – La Entubadera has a remarkable ability to transform massive northwest swell into perfectly formed, rideable waves.\n\nWhat makes this spot particularly special is its family-friendly atmosphere, complete with lifeguard services and a more relaxed crowd despite the wave's serious power. The combination of natural beauty, wave quality, and accessibility creates a surfing experience that appeals to both experienced barrel hunters and families looking for a spectacular day at the beach. The wave's ability to offer both intense tube rides and mellow sections means it can accommodate different skill levels on the same day.\n\nThe park setting creates an immersive natural experience where you share your sessions with native bird species and stunning dune landscapes. The protected status of this area ensures pristine conditions both in and out of the water, while the mix of surfers and beachgoers creates a vibrant, inclusive atmosphere that showcases the best of Fuerteventura's coastal culture. The spot's versatility means it can serve as a training ground for advancing surfers while still challenging experienced riders when conditions demand.",
      "location": {
        "area": "North East",
        "nearestTowns": [
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.71680334893953,
          "lng": -13.838868284051935,
          "accuracy": "google_maps_improved"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Left",
          "Right",
          "A-Frame"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "NW",
          "N"
        ],
        "bestWindDirection": [
          "W",
          "NW",
          "SW"
        ],
        "bestTide": [
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter",
          "Spring"
        ],
        "idealConditions": "Starts working when the north shore is getting oversized. Best with a large northwest swell and a westerly or northwesterly offshore wind. Produces powerful, medium-hollow waves under 50 meters in length.",
        "abilityLevel": {
          "primary": "Beginner",
          "alsoSuitableFor": [
            "Intermediate",
            "Advanced"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Low",
        "crowdNotes": "Few surfers.",
        "localVibe": "Relaxed and family-friendly.",
        "hazards": [
          "Powerful waves",
          "Shallow reef sections"
        ],
        "bottom": [
          "Sand",
          "Rock"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Easy access within the Corralejo Natural Park, extending from Flag Beach.",
        "parking": "Available nearby",
        "facilities": "Lifeguard service is present, making it a swim-safe and family-friendly beach.",
        "paddleOut": "Standard beach break paddle-out. Can be challenging on larger days with a strong shorebreak. Look for channels between the sandbanks.",
        "recommendedBoards": [
          "Shortboard",
          "Funboard / Malibu",
          "Longboard"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "la-escalera",
      "primaryName": "La Escalera",
      "alternativeNames": [
        "Playa de la Escalera",
        "Playa del Aguila",
        "Playa de las Escaleras"
      ],
      "description": "La Escalera earns its name from the dramatic steep staircase that leads you down to one of Fuerteventura's most picturesque and secluded beaches. Tucked between towering cliffs that create a natural amphitheater, this beautiful beach break offers a peaceful escape from the crowds and a genuine connection with nature.\n\nThe waves here are a mixed bag of left and right-handers that can range from gentle beginner-friendly rollers to more powerful walls when the conditions align. What makes La Escalera truly special is its atmosphere – the rugged beauty of the surroundings, the sound of waves echoing off the cliffs, and the feeling of having discovered your own private slice of paradise.\n\nThe cliffs provide excellent protection from northeast winds, making this spot particularly reliable on days when other west coast breaks are blown out. While the waves can be inconsistent, the uncrowded lineups and stunning setting make every session memorable, whether you're a beginner finding your feet or an experienced surfer seeking solitude.",
      "location": {
        "area": "North West",
        "nearestTowns": [
          "El Cotillo"
        ],
        "coordinates": {
          "lat": 28.6474736,
          "lng": -14.0217733,
          "accuracy": "google_maps_corrected"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "W",
          "NW",
          "N"
        ],
        "bestWindDirection": [
          "E",
          "N"
        ],
        "bestTide": [
          "Mid"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works best on a west to northwest swell with an easterly or northerly offshore wind. Best surfed at mid tide. The wave is hollow and can hold up to 2m (6ft).",
        "abilityLevel": {
          "primary": "Beginner",
          "alsoSuitableFor": []
        }
      },
      "characteristics": {
        "crowdFactor": "Empty",
        "crowdNotes": null,
        "localVibe": "Peaceful and secluded",
        "hazards": [
          "Rocks",
          "Falling rocks from cliffs",
          "Currents"
        ],
        "bottom": [
          "Sand",
          "Rock"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Located 5 km south of El Cotillo via a gravel road. The beach is accessed by descending a steep, characteristic staircase with around 160 steps.",
        "parking": "Available on the cliffs above the beach",
        "facilities": "None; no lifeguards on duty",
        "paddleOut": "Generally easy, with a fun path into the water",
        "recommendedBoards": [
          "Funboard / Malibu",
          "Longboard",
          "Beginner Board / Soft-top"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "la-izquierda-del-hierro",
      "primaryName": "La Izquierda del Hierro",
      "alternativeNames": [
        "Izquierda del Hierro",
        "El Hierro",
        "La Izquierda",
        "Yarro"
      ],
      "description": "La Izquierda del Hierro stands as one of Fuerteventura's most legendary and consistent left-hand reef breaks, earning its reputation through countless perfect sessions over the years. As part of the famous El Hierro section, this wave is the stuff of local lore – a powerful, fast-running left that reels endlessly along the volcanic reef, serving up machine-like barrels that draw expert surfers from across the island.\n\nWhen the north swell lines up with precision, La Izquierda transforms into a tube-riding masterpiece, offering long, hollow sections that test even the most skilled surfers. The wave breaks in front of a stunning beach, creating a beautiful contrast between the powerful reef action and the serene shoreline.\n\nDue to its incredible consistency and quality, this spot attracts a dedicated crowd whenever it's firing, but for those willing to share the lineup, the rewards are unforgettable – this is Fuerteventura surfing at its finest.",
      "location": {
        "area": "North",
        "nearestTowns": [
          "Playa de Majanicho",
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.741071639293903,
          "lng": -13.95132295887504,
          "accuracy": "google_maps_confirmed"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Left"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "NW",
          "N",
          "W"
        ],
        "bestWindDirection": [
          "S",
          "SE"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works best on a northwest or north swell with an offshore wind from the south or southeast. The spot is reliable and works on both local windswells and distant groundswells. The wave quality is not affected by the tide.",
        "abilityLevel": {
          "primary": "Expert",
          "alsoSuitableFor": []
        }
      },
      "characteristics": {
        "crowdFactor": "Crowded",
        "crowdNotes": null,
        "localVibe": "Known for strong localism; respect for local surfers is essential.",
        "hazards": [
          "Rocks",
          "Sharp reef",
          "Powerful waves"
        ],
        "bottom": [
          "Reef",
          "Lava"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Located on the North Shore, accessible via the northern dirt track road.",
        "parking": "Available along the track",
        "facilities": "None",
        "paddleOut": "Long and demanding paddle from the shore. Conserve energy for the session. Many use the channel between the left and The Bubble.",
        "recommendedBoards": [
          "Shortboard",
          "Step-up"
        ],
        "additionalTips": "This is a spot for experts only. It is crucial to observe the lineup, understand the local dynamics, and honestly assess your skill level before considering paddling out."
      }
    },
    {
      "id": "la-pared",
      "primaryName": "La Pared",
      "alternativeNames": [
        "Playa de La Pared",
        "El Viejo Rey Beach",
        "Playa del Viejo Rey"
      ],
      "description": "La Pared, known affectionately as 'El Viejo Rey' (The Old King), reigns as one of Fuerteventura's most iconic and reliable beach breaks. Positioned at the island's narrowest point, this expansive stretch of west coast coastline is virtually guaranteed to deliver rideable waves 365 days a year, making it a true surfing sanctuary.\n\nThe beauty of La Pared lies in its incredible versatility – this is where countless surfers have caught their first whitewater waves, yet on its day, the same beach can serve up powerful, hollow barrels that test even the most experienced riders.\n\nThe long, shifting sandbanks create a constantly changing canvas of peaks and sections, offering something for everyone from nervous beginners to seasoned wave hunters. The raw power of the Atlantic meets the island here, creating a dramatic backdrop and an authentic surfing experience that captures the essence of why people fall in love with the sport.",
      "location": {
        "area": "West",
        "nearestTowns": [
          "Pájara"
        ],
        "coordinates": {
          "lat": 28.214654468351718,
          "lng": -14.222965836524963,
          "accuracy": "google_maps_verified"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "NW",
          "W",
          "NNW"
        ],
        "bestWindDirection": [
          "SE",
          "S",
          "SW"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": "Best conditions vary by skill level.",
        "bestSeason": [
          "Spring",
          "Summer",
          "Autumn",
          "Winter"
        ],
        "idealConditions": "One of the most consistent spots on the island. Best for beginners at low tide with wide, gentle white water. Intermediate and advanced surfers find the best unbroken green waves from mid to high tide. Can be surfed in onshore winds when the east coast is working.",
        "abilityLevel": {
          "primary": "Beginner",
          "alsoSuitableFor": [
            "Intermediate",
            "Advanced"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Medium",
        "crowdNotes": "Can be crowded on weekends, quieter on weekdays.",
        "localVibe": "A welcoming hub for surf schools and a mix of local and visiting surfers; the foundational spot for the southern surf community.",
        "hazards": [
          "Strong currents (especially pulling south towards cliffs)",
          "Powerful waves (often stronger than they appear from the cliff)",
          "Rocks (in specific areas, e.g., near the bay's entrance)",
          "Optical illusion of wave size from the cliff top"
        ],
        "bottom": [
          "Sand",
          "Rock"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Very easy drive from the main southern highway, well-signposted for La Pared/Pájara. From the large cliff-top car park, two paths lead down: a stone-lined path to the main bay, and a natural staircase to a smaller bay (which can be cut off at high tide).",
        "parking": "Large, dedicated car park on the cliffs above the beach.",
        "facilities": "Surf schools and equipment hire operate nearby.",
        "paddleOut": "Generally easy. The main bay offers a long, gentle paddle. A strong current at the southern end can be used by experienced surfers to get out back but can be dangerous on big days.",
        "recommendedBoards": [
          "Beginner Board / Soft-top",
          "Longboard",
          "Funboard / Malibu",
          "Shortboard"
        ],
        "additionalTips": "Observe the waves from the cliff before paddling out, as they are consistently more powerful than they appear. Beginners should stick to the middle of the main bay. Advanced surfers can find more challenging waves at the southern end or in front of the natural staircase, but must be mindful of rocks and currents."
      }
    },
    {
      "id": "la-turbia",
      "primaryName": "Playa de la Turbia",
      "alternativeNames": [],
      "description": "Playa de la Turbia represents the raw, untamed heart of Fuerteventura's southern coast – a wild and remote stretch of coastline where dramatic volcanic cliffs plunge into deep blue Atlantic waters. Hidden away in the pristine Jandía Natural Park, this secluded beach offers a powerful and challenging beach break for experienced surfers willing to venture off the beaten path. The journey here is part of the adventure, taking you through some of the island's most spectacular landscapes where development gives way to nature's raw beauty.\n\nWhen the swell arrives, Playa de la Turbia comes alive with powerful peaks that demand respect and reward skill, offering surfers the rare opportunity to ride quality waves in complete solitude. This is pure, unfiltered Fuerteventura – no crowds, no facilities, just you, the waves, and one of the most dramatic backdrops you'll ever experience. The beach break can produce both lefts and rights, with A-frame sections that offer exciting opportunities for both regular and goofy-footed surfers.\n\nThe isolation and natural splendor create a surfing experience that transcends the mere act of riding waves – it's a journey into one of the island's last truly wild coastal environments. The lack of infrastructure means you need to come fully prepared, but the rewards include complete solitude, pristine conditions, and the chance to witness spectacular sunrises and sunsets without another soul in sight. This is where surfing returns to its adventurous roots, where the journey and destination merge into a single, unforgettable experience that connects you deeply with nature's power and beauty.",
      "location": {
        "area": "South",
        "nearestTowns": [
          "Cofete",
          "Puerto de la Cruz (0.6 km)",
          "Morro Jable"
        ],
        "coordinates": {
          "lat": 28.0848,
          "lng": -14.4921,
          "accuracy": "verified"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "W",
          "NW"
        ],
        "bestWindDirection": [
          "E",
          "SE"
        ],
        "bestTide": [
          "Mid",
          "High"
        ],
        "tideNotes": "Tends to close out at low tide on bigger swells.",
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works on powerful west or northwest swells with offshore easterly winds. A remote and serious beach break.",
        "abilityLevel": {
          "primary": "Advanced",
          "alsoSuitableFor": [
            "Expert"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Empty",
        "crowdNotes": "Very low.",
        "localVibe": "Secluded and peaceful; favored by hikers and those seeking solitude.",
        "hazards": [
          "Rocks in water",
          "Strong currents",
          "Powerful waves",
          "No lifeguards",
          "Remote location"
        ],
        "bottom": [
          "Sand",
          "Rock"
        ],
        "waterQuality": "Clear green water"
      },
      "practicalities": {
        "access": "Remote access via a long, bumpy dirt track. A 4x4 vehicle is highly recommended. The turn-off is near Cofete.",
        "parking": "Available near the beach",
        "facilities": "None. No lifeguards, restrooms, showers, or shops. It is a completely untouched and natural beach.",
        "paddleOut": "Descent to the water is normal but water shoes are necessary due to rocks and boulders.",
        "recommendedBoards": [
          "Shortboard",
          "Step-up"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "playa-de-las-mujeres-jarugo",
      "primaryName": "Playa de las Mujeres",
      "alternativeNames": [
        "Playa de Jarugo",
        "Playa de Jarubio",
        "Jarubio Beach"
      ],
      "description": "Playa de las Mujeres is one of those magical west coast spots that seems to operate on its own swell schedule, often delivering perfect waves when the rest of the island is eerily flat. This wild and expansive stretch of sandy coastline captures the raw, untamed spirit of Fuerteventura's Atlantic-facing shores – powerful, reliable, and beautifully uncrowded.\n\nThe beach has an incredible ability to pick up swell from virtually any direction, making it the ultimate backup spot for savvy locals who know that when the north shore goes quiet, Las Mujeres is likely firing. The waves here are versatile enough to suit all skill levels, from gentle peelers perfect for beginners to more powerful walls that will challenge experienced surfers.\n\nWhat makes this spot truly special is its rugged charm and sense of isolation – here, you're surfing in a pristine natural environment where the dramatic cliffs and endless horizon create a backdrop that feels a world away from the developed tourist areas.",
      "location": {
        "area": "West",
        "nearestTowns": [
          "Tindaya"
        ],
        "coordinates": {
          "lat": 28.571255942335103,
          "lng": -14.048396944999695,
          "accuracy": "google_maps_verified"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "N",
          "NW",
          "W"
        ],
        "bestWindDirection": [
          "E"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Summer",
          "Autumn"
        ],
        "idealConditions": "Works on any swell from the north to west. Best with an easterly offshore wind. Known for its powerful waves and strong currents.",
        "abilityLevel": {
          "primary": "Intermediate",
          "alsoSuitableFor": []
        }
      },
      "characteristics": {
        "crowdFactor": "Low",
        "crowdNotes": null,
        "localVibe": "Secluded and undeveloped.",
        "hazards": [
          "Strong rip currents",
          "Powerful waves",
          "Powerful shore break",
          "Unmanned beach (no lifeguards)"
        ],
        "bottom": [
          "Sand"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Remote access via a long, bumpy dirt track. A car is essential, and a 4x4 is recommended. The turn-off is from the village of Tindaya.",
        "parking": "Available near the beach",
        "facilities": "None. No lifeguards, restrooms, showers, or shops. Bring all supplies, including water and sun protection.",
        "paddleOut": "Can be very challenging due to powerful shorebreak and strong rip currents. Assess conditions carefully and look for deeper channels.",
        "recommendedBoards": [
          "Shortboard",
          "Funboard / Malibu"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "las-playas-muelle",
      "primaryName": "Las Playas Muelle",
      "alternativeNames": [],
      "description": "Las Playas Muelle offers a unique and charming surfing experience that you won't find anywhere else on the island – a perfectly shaped left-hander that peels along the protective harbor wall, creating a rare wind-protected haven when other spots are being hammered by strong winds. This man-made wave works like clockwork, transforming northern swell into clean, long-running walls that are absolutely perfect for longboarders but equally enjoyable on any craft. The wave's predictable nature and gentle power make it ideal for skill development and pure surfing enjoyment.\n\nWhat makes this spot so special is its accessibility and consistency – it's the kind of place where you can practice your turns, work on your cross-stepping, or simply enjoy a mellow session without worrying about massive crowds or challenging conditions. The harbor setting creates a surreal backdrop where fishing boats and surfers share the same space, making for a truly distinctive Fuerteventura experience that blends the island's maritime heritage with its surf culture.\n\nThe unique environment fosters a special sense of community where locals and visitors gather to share waves and stories in a relaxed, family-friendly atmosphere. The convenience of nearby amenities and the safety of the harbor environment make it perfect for extended sessions and progression-focused practice. This is surfing at its most accessible and enjoyable, where the combination of protection, consistency, and scenic surroundings creates a memorable experience that keeps surfers returning day after day.",
      "location": {
        "area": "Southeast",
        "nearestTowns": [
          "Las Playitas"
        ],
        "coordinates": {
          "lat": 28.22774518,
          "lng": -13.98512363,
          "accuracy": "verified"
        }
      },
      "waveDetails": {
        "type": [
          "Breakwater / Jetty"
        ],
        "direction": [
          "Left"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "N",
          "NW"
        ],
        "bestWindDirection": [
          "W",
          "SW"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Needs a big north or northwest swell to start working. It is wind-protected and breaks smaller than other spots, ideal for longboards.",
        "abilityLevel": {
          "primary": "Beginner",
          "alsoSuitableFor": [
            "Intermediate",
            "Advanced"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Low",
        "crowdNotes": "Empty on weekdays, few surfers on weekends.",
        "localVibe": "Relaxed and often frequented by longboarders. Generally uncrowded.",
        "hazards": [
          "Man-made dangers (buoys, etc.)"
        ],
        "bottom": [
          "Rock"
        ],
        "waterQuality": "Good, but can be affected by harbour proximity."
      },
      "practicalities": {
        "access": "Easy to find with instant access (<5 min walk). Park your car as close to the harbor wall as possible.",
        "parking": "Available near the harbor",
        "facilities": "Basic facilities available in the nearby village.",
        "paddleOut": "Access by walking out the harbor wall and jumping in at the end.",
        "recommendedBoards": [
          "Longboard",
          "Funboard / Malibu"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "las-salinas",
      "primaryName": "Las Salinas",
      "alternativeNames": [
        "Playa de Salinas"
      ],
      "description": "Tucked away in Fuerteventura's remote southern Jandía peninsula, Las Salinas offers a pristine escape from the island's crowded surf spots. This exposed right-hand point break delivers consistent waves in a spectacular setting where rugged volcanic landscapes meet the Atlantic. The spot's strategic position on the southern coast provides optimal exposure to north-west swells, creating reliable surf conditions that work when many other locations are flat.\n\nThe journey to this uncrowded gem rewards surfers with quality rides and the freedom to share waves with just a handful of like-minded souls. The right-hand point wraps along the rocky headland, offering long walls that peel perfectly in the pristine southern swells. What makes Las Salinas truly special is its perfect balance of power and consistency - the waves here are strong enough to be exciting but manageable enough for intermediate surfers to progress their skills.\n\nPerfect for those seeking solitude and reliable surf away from the tourist trail, Las Salinas represents the essence of adventure surfing. The dramatic journey through the Jandía Natural Park, combined with the promise of empty lineups and quality waves, creates an unforgettable experience that captures the raw beauty of Fuerteventura's southern coast. When the swell aligns, this spot delivers some of the most memorable rides in the Canaries.",
      "location": {
        "area": "South",
        "nearestTowns": [
          "Pájara",
          "Morro Jable"
        ],
        "coordinates": {
          "lat": 28.0756,
          "lng": -14.4719,
          "accuracy": "verified"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "S",
          "SW"
        ],
        "bestWindDirection": [
          "NE",
          "N"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Winter"
        ],
        "idealConditions": "Works best when a South swell combines with an offshore Northeast wind. It is a very consistent spot that works at all stages of the tide.",
        "abilityLevel": {
          "primary": "Advanced",
          "alsoSuitableFor": []
        }
      },
      "characteristics": {
        "crowdFactor": "Low",
        "crowdNotes": "Rarely crowded.",
        "localVibe": "Very quiet and isolated. You will likely be surfing alone or with a handful of others.",
        "hazards": [
          "Rocks"
        ],
        "bottom": [
          "Reef",
          "Rock"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Remote location; access details are approximate.",
        "parking": "Informal parking at the end of a long dirt track.",
        "facilities": "None. This is a remote, natural area.",
        "paddleOut": "Entry over reef and rocks is required. Booties are recommended. Look for a deeper channel.",
        "recommendedBoards": [
          "Shortboard",
          "Performance Board"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "isla-de-lobos",
      "primaryName": "Isla de Lobos",
      "alternativeNames": [
        "Los Lobos"
      ],
      "description": "A true Atlantic legend, Isla de Lobos guards one of the most coveted right-hand point breaks in the entire region. This boat-access only sanctuary delivers extraordinary mechanical waves that peel for several hundred meters across a surreal lunar landscape that feels like surfing on another planet. The small island, located just 2km northeast of Fuerteventura, creates a perfect natural wave chamber that transforms Atlantic swells into precision-engineered perfection.\n\nWhen powerful NW swells march across the Atlantic, the island transforms into a world-class surfing arena where perfectly formed sections offer endless rides. The right-hand point break works with remarkable consistency, producing fast walls that hold their shape for hundreds of meters. What makes Isla de Lobos truly magical is the combination of perfect wave mechanics, pristine water clarity, and the dramatic volcanic scenery that creates an otherworldly surfing experience found nowhere else in the Canaries.\n\nThe dramatic volcanic backdrop and crystalline waters create an unforgettable experience that ranks among the most coveted surfing pilgrimages in the Atlantic. The journey itself adds to the adventure - requiring a short boat ride from Corralejo that separates the everyday from the extraordinary. Once there, surfers are rewarded with not just world-class waves but also the complete serenity of a protected natural environment where the only sounds are the crashing waves and calling seabirds. This is surfing in its purest, most magnificent form.",
      "location": {
        "area": "Offshore",
        "nearestTowns": [
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.73980929574009,
          "lng": -13.83286753653365,
          "accuracy": "google_maps_confirmed"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break",
          "Point Break"
        ],
        "direction": [
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "N",
          "NW"
        ],
        "bestWindDirection": [
          "ESE",
          "E"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter",
          "Spring"
        ],
        "idealConditions": "Requires a large north or northwest swell. The wave quality increases with size, transforming from a sectioned wave at 4-6 foot into one long, rifling wall on bigger swells. Best with easterly offshore winds.",
        "abilityLevel": {
          "primary": "Expert",
          "alsoSuitableFor": []
        }
      },
      "characteristics": {
        "crowdFactor": "High",
        "crowdNotes": "Moderate to High.",
        "localVibe": "Competitive but tolerant; a high-performance wave with a dedicated local and visiting crew.",
        "hazards": [
          "Ultra-sharp lava reef",
          "Sea urchins",
          "Strong currents",
          "Remote location"
        ],
        "bottom": [
          "Lava",
          "Reef"
        ],
        "waterQuality": "Very clean, Caribbean-like"
      },
      "practicalities": {
        "access": "Access is by ferry or private water taxi from Corralejo. Surfers are dropped directly into the lineup and must arrange a specific pick-up time.",
        "parking": "Park in Corralejo and walk to the harbor.",
        "facilities": "Basic facilities (toilets, a small restaurant) are available on the island, but are a walk from the break.",
        "paddleOut": "The entry and exit are tricky over the urchin-carpeted reef. Paddling strength and endurance are essential.",
        "recommendedBoards": [
          "Shortboard",
          "Gun"
        ],
        "additionalTips": "This is a serious wave for experts only. Respect the lineup and be prepared for the logistical challenge of a boat trip. The wave is often cited as one of the longest right-handers in the Atlantic/European zone."
      }
    },
    {
      "id": "los-hoteles",
      "primaryName": "Los Hoteles",
      "alternativeNames": [
        "Grandes Playas"
      ],
      "description": "Nestled along Corralejo's iconic Grandes Playas, Los Hoteles offers a unique surfing experience directly in front of the Riu resorts. What makes this spot special is its completely soft sandy bottom that creates a forgiving playground perfect for beginners and intermediates. The wave breaks in predictable patterns that help developing surfers understand wave dynamics without the pressure of more demanding breaks.\n\nThe gentle, rolling waves provide an ideal learning environment where you can practice without worry. The spot's consistency and mellow nature make it perfect for working on fundamental skills - from paddle technique and timing to pop-ups and basic maneuvers. The shallow sandbars create perfect small waves that peel softly, allowing for extended practice sessions and rapid skill development.\n\nThere's a magical quality to this evening-only sanctuary - once the lifeguards finish their duties, the beach transforms into your private surf domain where you can catch mellow rides during the golden hours as the sun sets over the Atlantic. The tourist-friendly location means you'll have an audience of admiring hotel guests, while the nearby amenities provide convenient access to showers, restaurants, and equipment rental, making it one of the most comfortable surf experiences on the island.",
      "location": {
        "area": "North East",
        "nearestTowns": [
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.7127,
          "lng": -13.8395,
          "accuracy": "verified"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "N",
          "NW"
        ],
        "bestWindDirection": [
          "S",
          "SW"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Spring",
          "Summer",
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works on small to medium north or northwest swells. Best in the evening with light winds after the lifeguards have left.",
        "abilityLevel": {
          "primary": "Beginner",
          "alsoSuitableFor": [
            "Intermediate"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Low",
        "crowdNotes": "Not crowded.",
        "localVibe": "Chill and relaxed evening sessions.",
        "hazards": [
          "Swimmers and sunbathers (during daytime)",
          "No lifeguard (in the evening)"
        ],
        "bottom": [
          "Sand"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Easy access from the Grandes Playas, right in front of the hotel complex.",
        "parking": "Parking available along the beach road.",
        "facilities": "All hotel amenities (restaurants, bars, toilets) are nearby, but not directly available to the public.",
        "paddleOut": "Very easy due to the soft, sandy bottom and gentle slope.",
        "recommendedBoards": [
          "Beginner Board / Soft-top",
          "Longboard",
          "Funboard / Malibu"
        ],
        "additionalTips": "Surfing is NOT allowed during daytime due to the high number of swimmers. The session window is typically after 18:00 when the lifeguards are off duty and the beach clears out. Respect this rule to maintain access."
      }
    },
    {
      "id": "majanicho",
      "primaryName": "Majanicho",
      "alternativeNames": [
        "Majanicho Inside",
        "Majanicho La Baja"
      ],
      "description": "Majanicho enchants visitors with its rustic fishing village charm and a remarkably reliable reef break that serves up long, predictable right-handers. This spot is a dream for intermediate surfers looking to perfect their cutbacks and flow, with multiple sections including a main peak and gentler inside areas. The wave breaks over volcanic reef that creates consistent shape and offers both performance sections and more mellow rides depending on swell size.\n\nWhat makes Majanicho special is its adaptability - when other north shore spots are maxing out, this sheltered cove comes alive with perfectly shaped A-frames. Even on days with stubborn onshore winds, you'll find surfable conditions here thanks to the natural protection offered by the surrounding coastline. The spot's unique position means it can handle a wide range of swell directions and still produce quality waves.\n\nThe laid-back atmosphere and stunning coastal setting create a perfect learning environment where you can progress your skills in peace. The traditional fishing village adds authentic character to your surf experience, with colorful boats and the occasional fisherman heading out to sea creating a living backdrop to your sessions. The short but scenic drive from Corralejo takes you through some of the island's most beautiful landscapes, while the local crew is known for their welcoming attitude toward respectful visitors who appreciate the spot's mellow vibe.",
      "location": {
        "area": "North",
        "nearestTowns": [
          "El Cotillo",
          "Corralejo",
          "Lajares"
        ],
        "coordinates": {
          "lat": 28.743887,
          "lng": -13.936072,
          "accuracy": "verified"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Right",
          "A-Frame"
        ],
        "directionNotes": "Main break is a right, La Baja is an A-frame.",
        "bestSwellDirection": [
          "N"
        ],
        "bestWindDirection": [
          "E"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": "Main peak is best at low tide, inside breaks work on all tides.",
        "bestSeason": [
          "Autumn",
          "Winter",
          "Spring"
        ],
        "idealConditions": "Mellow right hander that picks up north swell. Inside breaks work when main north shore spots are oversized. Long paddle out to main peak.",
        "abilityLevel": {
          "primary": "Intermediate",
          "alsoSuitableFor": [
            "Beginner",
            "Longboarder"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Medium",
        "crowdNotes": "Popular SUP spot, can be crowded.",
        "localVibe": "Shared with windsurfers when Calima wind picks up",
        "hazards": [
          "Long paddle",
          "Reef",
          "Windsurfers during Calima"
        ],
        "bottom": [
          "Reef"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Accessible by car, park above the bay",
        "parking": "Available on headland",
        "facilities": "None at spot",
        "paddleOut": "Long paddle to main peak; use little beach in corner for inside breaks to avoid reef walk",
        "recommendedBoards": [
          "Funboard / Malibu",
          "Longboard",
          "SUP"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "mejillones-popcorn-reef",
      "primaryName": "Mejillones",
      "alternativeNames": [
        "Popcorn Reef",
        "Pop Corn Reef"
      ],
      "description": "Mejillones commands respect as one of Fuerteventura's most formidable big-wave arenas, where powerful Pacific-style energy detonates over a shallow volcanic reef. This spot is famously situated beside the unique 'Popcorn Beach' - a stunning stretch of white coral fragments that create an otherworldly landscape. The wave breaks over treacherous underwater volcanic formations that can hold enormous size while maintaining terrifyingly perfect shape.\n\nWhen the swell really turns on, Mejillones transforms into a serious board-breaking machine that attracts the island's most experienced chargers, sometimes even requiring tow-in assistance to catch the mountainous faces. This is definitely expert-only territory where courage meets consequence in spectacular fashion. The wave offers both rights and lefts, with the left being the longer, more coveted option that can stretch for hundreds of yards when the conditions align perfectly.\n\nThe location itself adds to the mystique - the popcorn-like coral fragments that give the beach its name create a surreal backdrop to one of the island's most serious waves. On big days, the atmosphere here is electric with anticipation as locals and visiting big-wave specialists gather to witness and attempt these oceanic giants. The isolation and raw power of Mejillones create an experience that's both terrifying and transformative for those brave enough to paddle out when it's truly firing.",
      "location": {
        "area": "North",
        "nearestTowns": [
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.7415,
          "lng": -13.9353,
          "accuracy": "unverified"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "W"
        ],
        "bestWindDirection": [
          "SW"
        ],
        "bestTide": [
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Best with west swell and south-west wind. Can get crowded when small. Serious conditions when big.",
        "abilityLevel": {
          "primary": "Expert",
          "alsoSuitableFor": []
        }
      },
      "characteristics": {
        "crowdFactor": "Medium",
        "crowdNotes": "Crowded when small, elite crew when big.",
        "localVibe": "Serious big-wave spot with tow-in potential",
        "hazards": [
          "Shallow reef",
          "Board snapper",
          "Powerful waves",
          "Expert only"
        ],
        "bottom": [
          "Lava",
          "Reef"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "4x4 recommended for access track",
        "parking": "Available on headland",
        "facilities": "None",
        "paddleOut": "Challenging due to power and currents",
        "recommendedBoards": [
          "Gun",
          "Step-up",
          "Tow Board"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "pico-de-las-motos",
      "primaryName": "Pico de las Motos",
      "alternativeNames": [
        "Pico de la Moto"
      ],
      "description": "Pico de las Motos flies under the radar as one of Fuerteventura's hidden treasures, tucked away just north of the capital. This powerful and exposed reef break delivers exceptional quality waves that have earned it recognition in local competitions, yet somehow maintains its uncrowded, local feel. The wave breaks over volcanic reef that creates both hollow sections and long walls, offering variety that keeps sessions interesting and challenging.\n\nThe spot serves up punchy, well-shaped sections that test your skills without the overwhelming crowds of the famous north shore breaks. When the conditions align, Pico de las Motos can produce world-class waves that rival the island's most famous spots, making it a well-kept secret among those in the know. The right-hander here offers steep takeoffs followed by fast, down-the-line racing sections that favor powerful surfers with good positioning skills.\n\nWhat makes Pico de las Motos truly special is its accessibility combined with quality - just minutes from the capital city yet delivering waves that feel remote and pristine. The local crew who frequent this spot are friendly and welcoming to respectful visitors, creating a relaxed atmosphere that's rare for waves of this quality. The spot's east coast location means it can work on different swell and wind combinations than the more famous breaks, providing valuable options when the usual spots aren't cooperating.",
      "location": {
        "area": "East",
        "nearestTowns": [
          "Puerto del Rosario"
        ],
        "coordinates": {
          "lat": 28.5167,
          "lng": -13.8667,
          "accuracy": "unverified"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Right"
        ],
        "directionNotes": "Primary right.",
        "bestSwellDirection": [
          "N",
          "NE",
          "NW"
        ],
        "bestWindDirection": [
          "S",
          "SW"
        ],
        "bestTide": [
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works best on a solid north or northwest groundswell with an offshore wind from the south or southwest. The wave is powerful and can hold a good size, making it a reliable option when conditions align.",
        "abilityLevel": {
          "primary": "Advanced",
          "alsoSuitableFor": [
            "Expert"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Low",
        "crowdNotes": "Uncrowded.",
        "localVibe": "Localistic; reserved for experienced surfers who know the spot.",
        "hazards": [
          "Shallow reef",
          "Strong currents",
          "Rocks"
        ],
        "bottom": [
          "Reef",
          "Rock"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Access via dirt tracks north of Puerto del Rosario, a 4x4 is recommended.",
        "parking": "Informal parking on the dirt tracks near the break.",
        "facilities": "None on site. All amenities available in nearby Puerto del Rosario.",
        "paddleOut": "Requires careful entry over rocks, potentially tricky depending on swell size.",
        "recommendedBoards": [
          "Shortboard",
          "Step-up"
        ],
        "additionalTips": "This is a spot for competent surfers. Its competition-level quality on its day means it should be approached with respect and local knowledge."
      }
    },
    {
      "id": "playa-blanca",
      "primaryName": "Playa Blanca",
      "alternativeNames": [],
      "description": "Playa Blanca stretches along the east coast between the airport and Puerto del Rosario, offering a welcoming introduction to surfing for beginners and a reliable fallback when the powerful west coast swells become too intense. This expansive sandy beach serves up gentle, forgiving waves that are perfect for those first-time encounters with unbroken green waves. The beach's unique orientation provides natural protection from the largest swells, making it one of the island's safest and most predictable surf locations.\n\nThe consistently mellow wind swells and evenly sloping sandy bottom create an ideal classroom environment where surf schools thrive and nervous newcomers can build confidence in waist-deep water. The gentle wave dynamics allow for extended practice sessions without the fatigue factor of more challenging breaks, helping beginners develop proper technique and ocean awareness in a controlled setting.\n\nWhile summer northeast winds provide the best conditions, this friendly spot delivers rideable waves year-round, making it a cornerstone of the island's surf education scene. The beach's proximity to the capital means it's easily accessible for locals and tourists alike, while the stunning white sand and clear waters create a picture-perfect learning environment. The relaxed atmosphere and supportive community make Playa Blanca not just a place to learn surfing, but a place to fall in love with the sport and the island's laid-back lifestyle.",
      "location": {
        "area": "East",
        "nearestTowns": [
          "Puerto del Rosario"
        ],
        "coordinates": {
          "lat": 28.4833,
          "lng": -13.85,
          "accuracy": "verified"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "NE",
          "E",
          "N",
          "SE"
        ],
        "bestWindDirection": [
          "N",
          "SW",
          "W"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Spring",
          "Summer",
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works on north-easterly wind swells generated by the trade winds. It is very consistent, working more than 150 days a year. White water is better at low tide, while unbroken green waves are more common at high tide. The wave period is short, making waves roll in frequently.",
        "abilityLevel": {
          "primary": "Beginner",
          "alsoSuitableFor": [
            "Intermediate",
            "Advanced"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Low",
        "crowdNotes": "Few surfers, but popular with surf schools.",
        "localVibe": "Relaxed and instructional, perfect for learning.",
        "hazards": [
          "Currents (pulling out to sea at the southern end)",
          "Rocks (at the southern end near the hotel)",
          "Dense wave frequency on bigger days"
        ],
        "bottom": [
          "Sand"
        ],
        "waterQuality": "Good"
      },
      "practicalities": {
        "access": "Extremely easy access from the main highway near Puerto del Rosario airport. Exit towards the sea after a left-hand bend when coming from the north.",
        "parking": "Use the large natural car park. Avoid parking on the dirt road behind the beach to avoid fines.",
        "facilities": "Easy access from the capital city Puerto del Rosario for all amenities.",
        "paddleOut": "Generally easy due to the gentle slope and less powerful waves. Beginners should stick to the middle of the bay.",
        "recommendedBoards": [
          "Beginner Board / Soft-top",
          "Longboard",
          "Funboard / Malibu"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "puerto-lajas",
      "primaryName": "Puerto Lajas",
      "alternativeNames": [],
      "description": "Puerto Lajas unfolds as a commanding bay just north of Fuerteventura's capital, where powerful A-frame waves detonate over characteristic stone slabs that give the spot its name. This east coast powerhouse comes alive during summer months when northeastern wind swells march across the bay, serving up head-high sets that break both left and right. The unique underwater topography creates multiple takeoff zones, offering variety that keeps experienced surfers engaged and challenged.\n\nThe spot operates on a natural timetable - early morning and evening sessions belong to surfers chasing clean walls, while midday trade winds transform the arena into a playground for wing-foilers, windsurfers, and kitesurfers. The rocky reef demands respect and rewards experienced riders with challenging, powerful waves in a spectacular setting. The A-frame nature means you can choose your preferred direction based on your style or the day's conditions.\n\nWhat makes Puerto Lajas truly special is its dual-sport nature and community atmosphere. The bay becomes a hub of water sports activity throughout the day, creating a vibrant scene where different disciplines coexist and interact. The proximity to Puerto del Rosario means you can grab coffee or lunch between sessions, while the historic fishing village setting adds character and authenticity to your surfing experience. The spot's exposure to varied conditions means it can deliver quality waves when other spots are flat, making it an essential part of any local surfer's spot rotation.",
      "location": {
        "area": "East",
        "nearestTowns": [
          "Puerto del Rosario"
        ],
        "coordinates": {
          "lat": 28.5401954,
          "lng": -13.8371086,
          "accuracy": "google_maps_verified"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Left",
          "Right",
          "A-Frame"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "NE",
          "N",
          "NW"
        ],
        "bestWindDirection": [
          "NW",
          "W"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Spring",
          "Summer"
        ],
        "idealConditions": "Needs a northeast wind swell delivering head-high sets. Best surfed in the morning and evening to avoid strong trade winds and wind-sport traffic that takes over the peak later in the day. The wave is relatively short, typically under 50 meters.",
        "abilityLevel": {
          "primary": "Intermediate",
          "alsoSuitableFor": [
            "Advanced"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Low",
        "crowdNotes": "Few surfers.",
        "localVibe": "Relaxed and less crowded, but can get busy with wind-sports during peak wind hours.",
        "hazards": [
          "Shallow rocky bottom with stone slabs",
          "Wind- and kitesurfers during trade winds"
        ],
        "bottom": [
          "Reef",
          "Rock"
        ],
        "waterQuality": "Good"
      },
      "practicalities": {
        "access": "Easy access by car, located just off the main road north of Puerto del Rosario.",
        "parking": "Available nearby",
        "facilities": "Limited facilities at the spot itself. The nearby capital, Puerto del Rosario, offers all amenities.",
        "paddleOut": "Straightforward paddle from the beach, but be mindful of the shallow rock slabs.",
        "recommendedBoards": [
          "Shortboard",
          "Funboard / Malibu",
          "Beginner Board / Soft-top"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "punta-blanca",
      "primaryName": "Punta Blanca",
      "alternativeNames": [],
      "description": "Punta Blanca offers a refreshing contrast to the powerful north shore breaks, delivering gentle, forgiving waves that create the perfect learning environment for beginners and improving surfers. This welcoming reef break specializes in mushy, disorganized waves that are ideal for those epic long whitewater rides that build confidence and skills.\n\nWhat makes this spot special is its remarkable consistency as a swell magnet - you'll almost always find rideable waves here regardless of conditions. While the waves may not break in picture-perfect formation like other north shore spots, they provide endless opportunities for practice and progression.\n\nLongboarders particularly enjoy the clean, small days when the reforming green waves offer endless glide time. Do note that this is prime windsurfing territory, so sharing the waves is part of the experience.",
      "location": {
        "area": "North",
        "nearestTowns": [
          "El Cotillo",
          "Majanicho"
        ],
        "coordinates": {
          "lat": 28.725089427907317,
          "lng": -13.988137396355274,
          "accuracy": "google_maps_improved"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Right",
          "Left"
        ],
        "directionNotes": "Right is primary, occasional Lefts.",
        "bestSwellDirection": [
          "N",
          "NW",
          "NNW"
        ],
        "bestWindDirection": [
          "E",
          "SE"
        ],
        "bestTide": [
          "Mid"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Spring",
          "Summer",
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works on all northern swells. Best at mid-tide; avoid low tide when the swell is 1.5m or larger due to the shallow bottom. Offers plenty of waves, making it good for practice, but is often messy. Surf schools frequently use this spot.",
        "abilityLevel": {
          "primary": "Beginner",
          "alsoSuitableFor": [
            "Intermediate",
            "Longboarder"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Crowded",
        "crowdNotes": "Very crowded.",
        "localVibe": "Shared with windsurfers and surf schools.",
        "hazards": [
          "Sea urchins",
          "Rocks",
          "Shallow bottom (at low tide)",
          "Currents"
        ],
        "bottom": [
          "Reef"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Accessible via a dirt road from either El Cotillo or Majanicho. The road is suitable for all types of vehicles.",
        "parking": "Ample informal parking along the dirt track overlooking the various peaks.",
        "facilities": "None. Nearest facilities are in Majanicho or El Cotillo.",
        "paddleOut": "Use the channel to paddle out.",
        "recommendedBoards": [
          "Longboard",
          "Funboard / Malibu",
          "Beginner Board / Soft-top"
        ],
        "additionalTips": "This is first and foremost a windsurf spot. If windsurfers are rigging or start sailing, you should leave or not enter the water for your own safety."
      }
    },
    {
      "id": "punta-del-tigre",
      "primaryName": "Punta del Tigre",
      "alternativeNames": [
        "La Turbia"
      ],
      "description": "Punta del Tigre roars to life in Fuerteventura's dramatic southern wilderness near Punta de Jandía, where raw Atlantic energy detonates over a rugged volcanic reef. This exposed beast is famous for delivering powerful, hollow cylinders that challenge even the most experienced surfers seeking tube time. The spot's remote location ensures solitude, with just the dramatic coastal landscape as your audience. The left-hander here wraps around the point, creating long, perfectly shaped walls that can hold size and offer multiple barrel sections.\n\nWhen the swell aligns, Punta del Tigre serves up thrilling, barreling sections that test your nerve and reward courage with unforgettable rides in one of the island's most spectacular settings. This is serious territory for advanced surfers who appreciate raw power and pristine natural beauty. The wave breaks over unforgiving volcanic rock that can create dredging barrels when the tide is right, making every successful ride feel like a major accomplishment.\n\nThe journey to Punta del Tigre is part of the adventure - requiring a rugged 4WD trek through some of the island's most remote and beautiful landscapes. This isolation means you'll often have the wave to yourself or with a small crew of dedicated locals who understand its dangers and rewards. The dramatic cliffs and untouched coastline create a sense of timelessness here, where the only sounds are the crashing waves and the occasional calls of seabirds. It's a place where surfing returns to its purest form - just you, the ocean, and one of the most powerful waves in the Canaries.",
      "location": {
        "area": "South",
        "nearestTowns": [
          "Morro Jable",
          "Pájara"
        ],
        "coordinates": {
          "lat": 28.0806,
          "lng": -14.504485,
          "accuracy": "verified"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Left"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "SW",
          "N",
          "NE",
          "W"
        ],
        "bestWindDirection": [
          "N",
          "NE",
          "S",
          "SE",
          "E"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": "Best at Mid & High Tide.",
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works best when a Southwest groundswell combines with an offshore north wind. An inconsistent spot that does not work very often, with optimal conditions more frequent in winter.",
        "abilityLevel": {
          "primary": "Expert",
          "alsoSuitableFor": []
        }
      },
      "characteristics": {
        "crowdFactor": "Low",
        "crowdNotes": "Rarely gets crowded.",
        "localVibe": "Solitary and secluded.",
        "hazards": [
          "Rocks",
          "Strong currents",
          "Shallow reef",
          "Isolation"
        ],
        "bottom": [
          "Lava",
          "Reef"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Access via the very long and rough dirt track leading to the Punta de Jandía lighthouse. A 4x4 vehicle is strongly recommended.",
        "parking": "Informal parking near the end of the track.",
        "facilities": "None. One of the most remote parts of the island.",
        "paddleOut": "Extremely difficult entry over sharp volcanic rock. High risk of injury and board damage. Expert only.",
        "recommendedBoards": [
          "Shortboard",
          "Gun"
        ],
        "additionalTips": "Due to its isolated location and powerful waves, this spot requires self-sufficiency and caution. The wave is very inconsistent and often too small, but can provide excellent conditions when it works."
      }
    },
    {
      "id": "punta-elena",
      "primaryName": "Punta Elena",
      "alternativeNames": [
        "Bajo del Medio",
        "Rocky Point"
      ],
      "description": "A prominent reef break strategically positioned between the island of Lobos and Corralejo, serving as a sanctuary when the North Shore swells grow too powerful. This spot transforms into a wave paradise with long, shoulder-breaking right-handers on the outside section, while the inside area offers playful, faster lefts and rights perfect for honing your skills.\n\nThe beauty of Punta Elena lies in its versatility - the outer reef delivers those dreamy, long rides that intermediate surfers crave, making it particularly famous among longboarders and SUP enthusiasts seeking quality wave time. When the main breaks are closing out, you'll find this spot working beautifully, offering consistent shoulders that seem to go on forever.\n\nSmart access is key here - instead of tackling the treacherous lava rock hike, paddle in 'around the corner' for a much safer entry. During the prime months between November and March, this spot really shows its character, providing that perfect escape when other spots are maxed out.",
      "location": {
        "area": "North East",
        "nearestTowns": [
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.7321787,
          "lng": -13.8587809,
          "accuracy": "google_maps_corrected"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Right",
          "Left"
        ],
        "directionNotes": "Primary outside is a right, inside offers lefts and rights.",
        "bestSwellDirection": [
          "N",
          "NW"
        ],
        "bestWindDirection": [
          "S",
          "SE"
        ],
        "bestTide": [
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Starts working when the North Shore is getting big. The outside offers long, guaranteed right shoulders, while the inside provides faster sections.",
        "abilityLevel": {
          "primary": "Intermediate",
          "alsoSuitableFor": [
            "Longboarder",
            "SUP"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Medium",
        "crowdNotes": "Can be crowded.",
        "localVibe": "Popular and accessible spot.",
        "hazards": [
          "Rocks",
          "Urchins"
        ],
        "bottom": [
          "Reef"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "From Corralejo, follow 'Avenida grandes playas' until the bar 'Pura-vida', then take the next left. Park and take the small path down to the waterfront, which brings you out directly in front of the left-hander.",
        "parking": "Street parking available.",
        "facilities": "Bars and amenities of Corralejo are nearby.",
        "paddleOut": "Tip: Launch your board behind the corner to avoid a long and painful rocky walk.",
        "recommendedBoards": [
          "Longboard",
          "Funboard / Malibu",
          "SUP",
          "Shortboard"
        ],
        "additionalTips": null
      }
    },
    {
      "id": "punta-gorda",
      "primaryName": "Punta Gorda",
      "alternativeNames": [],
      "description": "A beautifully sheltered left-hand point break that serves as North Shore's ultimate sanctuary when conditions turn challenging elsewhere. This remarkable spot transforms unruly swells into perfectly shaped waves that peel predictably into the bay, offering multiple sections to play with and explore.\n\nWhat makes Punta Gorda truly special is its remarkable resilience - even when strong onshore winds are wreaking havoc on other breaks, this protected corner maintains clean, rideable faces. Large swells undergo a magical transformation as they reform over the shallow take-off zone, creating a beautiful left-hander with several distinct sections that allow for both strategic maneuvering and pure cruising pleasure.\n\nBe prepared for a workout though - the bay's natural geography creates a persistent current that demands constant paddling to maintain position. This physical challenge is more than worth it for the reward of perfectly formed waves when everywhere else is blown out or maxed out.",
      "location": {
        "area": "North",
        "nearestTowns": [
          "El Cotillo"
        ],
        "coordinates": {
          "lat": 28.7199854,
          "lng": -13.998127,
          "accuracy": "google_maps_corrected"
        }
      },
      "waveDetails": {
        "type": [
          "Point Break",
          "Reef Break"
        ],
        "direction": [
          "Left"
        ],
        "directionNotes": null,
        "bestSwellDirection": [
          "N",
          "NW"
        ],
        "bestWindDirection": [
          "E",
          "NE"
        ],
        "bestTide": [
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Summer",
          "Autumn",
          "Winter",
          "Spring"
        ],
        "idealConditions": "Works when other spots are oversized or windy. Even surfable with a strong onshore wind. The wave reforms on a often shallow take-off zone before peeling left.",
        "abilityLevel": {
          "primary": "Beginner",
          "alsoSuitableFor": [
            "Intermediate",
            "Advanced"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Crowded",
        "crowdNotes": "Always crowded.",
        "localVibe": "Protected by locals; respect is essential.",
        "hazards": [
          "Very strong currents",
          "Shallow take-off zone",
          "Rocks"
        ],
        "bottom": [
          "Reef"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Accessible via the western end of the North Shore dirt track, starting from near El Cotillo.",
        "parking": "Informal parking on the cliffs overlooking the break.",
        "facilities": "None. Nearest facilities are in El Cotillo.",
        "paddleOut": "Non-stop paddling is a must to fight the strong current.",
        "recommendedBoards": [
          "Shortboard",
          "Funboard / Malibu"
        ],
        "additionalTips": "The current can suck you towards the rocks if you lose your position. Watch how the local surfers manage the lineup and avoid messing up the peak."
      }
    },
    {
      "id": "playa-de-garcey-racetracks",
      "primaryName": "Playa de Garcey",
      "alternativeNames": [
        "The Shipwreck",
        "Racetracks",
        "American Star Wreck"
      ],
      "description": "Where maritime history meets surfing perfection, Playa de Garcey stands as one of Fuerteventura's most historically significant surf destinations. This remote wild west coast bay earned its place in history as the final resting place of the SS American Star shipwreck, which ran aground here on January 18, 1994, creating a legendary tale that still captivates visitors today. The rusting remnants of this once-majestic ocean liner served as a surreal surfing landmark for years, though time and tide have largely claimed the wreck back to the Atlantic.\n\nWhat makes Playa de Garcey truly special among west coast spots is its unique geography that creates an oasis of protection in an otherwise exposed coastline. Unlike its neighboring breaks that bear the full brunt of Atlantic force, this bay's configuration provides lighter and often offshore wind conditions, transforming what could be punishing sessions into perfect surfing opportunities. The spot delivers a versatile beach break with distinct left and right-hand peaks that work in harmony, while a relatively safe channel provides easy paddle-out access that eliminates the grueling battles common to other west coast locations.\n\nThe friendly, sheltered atmosphere of Playa de Garcey creates an inclusive environment that welcomes surfers of all abilities. Beginners can find their confidence in the manageable white water, while advanced surfers push their limits on the main peaks that offer both power and maneuverability. The bay's protected nature means consistent, rideable waves even when other spots are blown out or maxed out. This combination of historical significance, unique geography, and user-friendly conditions makes Playa de Garcey a must-visit destination where surfing culture and maritime heritage create an unforgettable experience on Fuerteventura's rugged west coast.",
      "location": {
        "area": "West",
        "nearestTowns": [
          "Pájara",
          "La Hermosa"
        ],
        "coordinates": {
          "lat": 28.346643617010102,
          "lng": -14.176504611968994,
          "accuracy": "google_maps_verified"
        }
      },
      "waveDetails": {
        "type": [
          "Beach Break"
        ],
        "direction": [
          "Right",
          "Left"
        ],
        "directionNotes": "Right on the north side, Left on the south side.",
        "bestSwellDirection": [
          "W",
          "NW",
          "N"
        ],
        "bestWindDirection": [
          "E"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": "Character changes dramatically.",
        "bestSeason": [
          "Spring",
          "Summer",
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works on west/northwest swells. The bay is uniquely sheltered, often creating offshore conditions. It handles larger swells well without closing out as easily as other beach breaks. Best for beginners at low tide with gentle white water; ideal for intermediates at mid-tide; advanced surfers find more powerful, larger waves at high tide.",
        "abilityLevel": {
          "primary": "Intermediate",
          "alsoSuitableFor": [
            "Beginner",
            "Advanced"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Low",
        "crowdNotes": "Relatively uncrowded.",
        "localVibe": "Friendly and popular with local families and campers; a respected spot where a friendly attitude is appreciated.",
        "hazards": [
          "Sharp metal wreckage (DO NOT CLIMB)",
          "Two currents: safe channel (north) & dangerous cliff-bound current (south)",
          "Rocks/round stones on bottom after storms",
          "Optical illusion - waves are stronger than they appear from the cliff"
        ],
        "bottom": [
          "Sand",
          "Rock"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Extremely challenging. A 4x4 vehicle is ABSOLUTELY ESSENTIAL for the very rough, unmaintained gravel road. From the main road to La Pared, look for the small 'Playa de Garcey' sign in the valley after the second mountain ridge.",
        "parking": "Park at the beginning of the bay. Driving onto the beach itself is prohibited.",
        "facilities": "None. Totally remote; bring all supplies including water.",
        "paddleOut": "Use the relatively safe and gentle channel on the northern end of the bay to get to the lineup. Avoid the southern end.",
        "recommendedBoards": [
          "Funboard / Malibu",
          "Shortboard",
          "Longboard"
        ],
        "additionalTips": "The wreckage is sharp and surrounded by unpredictable currents - observe from a distance. Be aware of your position to avoid being swept south towards the cliffs by the current. The waves are consistently more powerful than they look from the cliff top. A great fallback when other west coast spots are too windy or oversized."
      }
    },
    {
      "id": "suicidios",
      "primaryName": "Suicidios",
      "alternativeNames": [
        "Suicides"
      ],
      "description": "The legendary terror of Fuerteventura's infamous North Shore advanced breaks cluster, Suicidios earns its ominous alternative name \"Suicides\" through sheer wave brutality. Situated between Corralejo and El Cotillo, this spot forms part of the island's most feared coastline, where exposed reef formations create some of the heaviest waves in the Canaries. The name itself serves as a warning - this is genuinely gnarly and suicidal territory that demands total respect from those who dare to challenge it.\n\nWhen conditions align, Suicidios unleashes a terrifying right-hand monster that breaks over sharp lava reef with unapologetic force. The wave's two distinct sections offer different kinds of punishment: the first section is notoriously impossible to make, serving as a testing ground for only the most committed, while the second provides those rare, makeable barrels that become lifelong achievements. Both right and left reef breaks work here, but the right-handers are the stuff of local legend, capable of producing freight-train tubes across the exposed reef shelf.\n\nThis is unequivocally expert-only territory where local knowledge isn't just recommended - it's essential for survival. The wave's reputation as \"suicidal\" comes from its combination of extreme shallow water razor-sharp reef, raw power, and unforgiving sections that rarely offer mistakes. For the select few who master this break, Suicidios delivers the barrel of a lifetime, but the price of failure is severe. This spot represents the ultimate test of courage, skill, and wave-reading ability on Fuerteventura's treacherous North Shore.",
      "location": {
        "area": "North",
        "nearestTowns": [
          "Corralejo",
          "El Cotillo"
        ],
        "coordinates": {
          "lat": 28.7556,
          "lng": -13.8951,
          "accuracy": "medium"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Right",
          "Left"
        ],
        "directionNotes": "Main break is a right, also a shorter inside Left.",
        "bestSwellDirection": [
          "N",
          "NW",
          "NNW"
        ],
        "bestWindDirection": [
          "S",
          "SE",
          "SSE"
        ],
        "bestTide": [
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works best on a North-Northwest swell combined with an offshore South-Southeast wind. A consistent spot that is just as likely to work on local windswells as on distant groundswells. Holds swells up to 3 meters (10 feet).",
        "abilityLevel": {
          "primary": "Expert",
          "alsoSuitableFor": []
        }
      },
      "characteristics": {
        "crowdFactor": "Medium",
        "crowdNotes": "Sometimes crowded; surfed by a handful of highly skilled locals.",
        "localVibe": "Competitive and reserved for experts; high respect for locals is mandatory",
        "hazards": [
          "Submerged rocks",
          "Very sharp lava reef",
          "Strong currents",
          "Rips/undertow"
        ],
        "bottom": [
          "Lava",
          "Reef"
        ],
        "waterQuality": "Clean"
      },
      "practicalities": {
        "access": "Located along the northern dirt track. Follow it until you reach a vast lava field close to the coast. The walk to the spot is instant (less than 5 minutes).",
        "parking": "Available along the North Track",
        "facilities": "None",
        "paddleOut": "Challenging; getting into the water over sharp lava rock can be a hazard on bigger swells",
        "recommendedBoards": [
          "Shortboard",
          "Step-up"
        ],
        "additionalTips": "Wearing a helmet is recommended. This is not a spot for windsurfing or kitesurfing. It is crucial to watch the locals, talk to them, and assess your skill level honestly before even considering paddling out."
      }
    },
    {
      "id": "waikiki-beach",
      "primaryName": "Waikiki Beach",
      "alternativeNames": [
        "Playa Waikiki",
        "Galera Beach"
      ],
      "description": "Waikiki Beach, also known as Playa Waikiki or Galera Beach, sits as a sheltered oasis in the very heart of Corralejo town, offering one of the most accessible and versatile surfing experiences on the island. This prime beachfront location features a dedicated Waikiki Beach Club right on the sand with sweeping sea views, surrounded by a vibrant tourism infrastructure of hotels and apartments.\n\nThe bay's natural protection creates perfect conditions for multiple watersports - it's famous as a primary hub for wing foiling and windsurfing, while also offering gentle, accessible waves in the middle of the bay that make it ideal for beginner surfers. The easy access from town center means you can walk from your accommodation to the water within minutes.\n\nWhat makes Waikiki Beach truly special is its year-round consistency and protection from harsh conditions. The sheltered bay shields beginners from strong winds and currents while providing reliable learning waves, yet still offers enough power for progression when the conditions align. Near the magnificent Corralejo Dunes, this spot combines convenience with natural beauty.",
      "location": {
        "area": "North East",
        "nearestTowns": [
          "Corralejo"
        ],
        "coordinates": {
          "lat": 28.7345635,
          "lng": -13.8669294,
          "accuracy": "google_maps_corrected"
        }
      },
      "waveDetails": {
        "type": [
          "Reef Break"
        ],
        "direction": [
          "Left",
          "Right"
        ],
        "directionNotes": "Gentle, reforming waves in the middle of the bay.",
        "bestSwellDirection": [
          "NW"
        ],
        "bestWindDirection": [
          "W",
          "NW"
        ],
        "bestTide": [
          "Low",
          "Mid",
          "High"
        ],
        "tideNotes": null,
        "bestSeason": [
          "Autumn",
          "Winter"
        ],
        "idealConditions": "Works on northwest swells, typically in winter and autumn. The bay is well-protected, resulting in smaller, manageable waves ideal for beginners.",
        "abilityLevel": {
          "primary": "Beginner",
          "alsoSuitableFor": [
            "Intermediate"
          ]
        }
      },
      "characteristics": {
        "crowdFactor": "Medium",
        "crowdNotes": "Popular with multiple water sports.",
        "localVibe": "Lively and accessible, shared by wingfoilers, windsurfers, and beginner surfers.",
        "hazards": [
          "Reef at entry/exit",
          "Other water users (windsurfers, foilers)"
        ],
        "bottom": [
          "Sand",
          "Reef"
        ],
        "waterQuality": "Good"
      },
      "practicalities": {
        "access": "Extremely easy access from the beaches of Corralejo. A concrete pier allows water users to bypass the reef and enter the sea safely at all tide levels.",
        "parking": "Available in the town of Corralejo",
        "facilities": "The area is lined with several bars, restaurants, and commerce, making it a convenient and lively spot.",
        "paddleOut": "Easy, either directly from the beach or via the concrete pier.",
        "recommendedBoards": [
          "Beginner Board / Soft-top",
          "Longboard",
          "Funboard / Malibu"
        ],
        "additionalTips": null
      }
    }
  ]
}